Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/backup.po
Languages: ru_ru

source: `Backup`:index:
ru_ru: `Резервное копирование`:index:

source: The *Backup* dialog provides an easy-to-use interface for the pg_dump `pg_dump <http://www.postgresql.org/docs/current/interactive/app-pgdump.html>`_ command line utility. Easy to use options allow you to backup a database, a schema definition, data, or an database object.
ru_ru: Диалог *Резервное копирование* предоставляет удобный интерфейс для вызова утилиты командной строки `pg_dump <https://postgrespro.ru/docs/postgresql/current/app-pgdump.html>`_. Настраивая параметры в нём, вы можете легко сделать резервную копию базы данных, объекта базы, собственно данных или определения схемы.

source: By selecting fields on the *Backup* dialog, you specify which options should be included in a customized pg_dump command. The pg_dump command writes an archive that you can use with the pgAdmin's :ref:`*Restore* <restore>` dialog, the `psql client <http://www.postgresql.org/docs/current/interactive/app-psql.html>`_ , or pg_restore to recreate the objects backed up by the archive.
ru_ru: Воспользовавшись полями в диалоге *Резервного копирования*, вы можете установить, какие аргументы должны быть переданы формируемой команде pg_dump. Команда pg_dump сохраняет архив, из которого впоследствии можно восстановить все или некоторые объекты, используя диалог :ref:`Восстановление <restore>` в pgAdmin или `клиент psql <https://postgrespro.ru/docs/postgresql/current/app-psql.html>`_ или pg_restore.7

source: If you choose to create a plain-text backup, you can review the SQL commands that build the selected object to better help you understand how the object will be recreated. You can also optionally modify the content to create new database objects before restoring.
ru_ru: Если вы решили создать архив в формате простого текста, вы сможете просмотреть SQL-команды, создающие выбранный объект, чтобы лучше понимать, что стоит за созданием этого объекта. Вы также можете при желании модифицировать команды, создающие объекты базы данных, прежде чем производить восстановление.

source: Supported File Formats
ru_ru: Поддерживаемые форматы файлов

source: The drop-down listbox in the *Format* field allows you to select an archive format. Each format has advantages and disadvantages; select the format that is best suited for your application:
ru_ru: В выпадающем списке в поле *Формат* вы можете выбрать формат архива. Каждый формат имеет свои преимущества и недостатки; выберите формат, наиболее подходящий для ваших целей:

source: Select *Plain* to generate a plain-text script file containing SQL statements and commands that you can execute at the psql command line or with pg_dump to recreate the database objects and load the table data. A plain-text backup file can easily be edited in a text editor if desired before restoring the database objects with the psql program. Plain-text format is normally recommended for smaller databases.
ru_ru: Выберите формат *Простой*, чтобы получить простой текстовый скрипт, содержащий операторы SQL и команды, который вы сможете выполнить в командной строке psql или с помощью pg_dump. В результате выполнения этого скрипта можно воссоздать объекты базы данных и загрузить данные в таблицы. Этот обычный текстовый файл копии при желании можно легко отредактировать в текстовом редакторе, прежде чем восстанавливать объекты базы данных с помощью программы psql. Данный формат обычно рекомендуется для сравнительно небольших баз данных.

source: Select *Custom* to generate a pg_dump formatted binary file that allows for restoration of all or only selected database objects from the backup file. You can use pgAdmin to restore from a custom archive backup file. A custom archive backup file cannot be edited, but you can use pgAdmin to select which database objects to restore from the backup file. Custom archive format is recommended for medium to large databases from which you may want to select the database objects to restore from the backup file.
ru_ru: Выберите формат *Специальный*, чтобы получить двоичный файл в специальном формате pg_dump, позволяющем восстановить из файла копии все или только избранные объекты баз данных. Восстановить данные из специального формата вы можете с помощью pgAdmin. Файл в таком формате нельзя редактировать, но pgAdmin позволяет выбрать объекты базы данных для восстановления. Специальный формат рекомендуется для баз от среднего до большого размера, если у вас может возникнуть желание восстанавливать избранные объекты из файла архива.

source: Select *Tar* to generate a tar archive file that allows for restoration of all or only selected database objects from the backup file. You can use pgAdmin to restore from a tar archive backup file.
ru_ru: Выберите формат *Tar*, чтобы получить файл архива tar, из которого можно восстанавливать все или только отдельные объекты базы данных. Для восстановления из файла копии в формате tar так же можно использовать pgAdmin.

source: Select *Directory* to generate a directory-format archive suitable for use with pgAdmin's Restore dialog or pg_restore. This file format creates a directory with one file for each table and blob being dumped, plus a Table of Contents file describing the dumped objects in a machine-readable format that pg_restore can read. A directory format archive can be manipulated with standard Unix tools; for example, files in an uncompressed archive can be compressed with the gzip tool. This format is compressed by default and supports parallel dumps.
ru_ru: Выберите *Каталог*, чтобы получить архив в формате каталога, подходящий для восстановления с помощью средства восстановления в pgAdmin или утилиты pg_restore. В таком формате создаётся каталог с отдельным файлом для каждой таблицы и двоичных данных, а также файл оглавления, описывающий выгруженные объекты в машинно-ориентированной структуре, которую сможет прочитать pg_restore. Архивом в формате каталога можно оперировать с помощью стандартных утилит Unix; например, файлы в несжатом архиве можно сжать с помощью gzip. По умолчанию этот формат сжимается и поддерживает распараллеливание выгрузки данных.

source: The Backup Dialog
ru_ru: Диалог резервного копирования

source: To open the *Backup* dialog, right click on the name of a database or a named object in the tree control and select *Backup…* from the context menu. The *Backup* dialog opens:
ru_ru: Чтобы открыть диалог *Резервное копирование*, щёлкните имя базы данных или некоторого объекта в дереве правой кнопкой и выберите в контекстном меню *Резервная копия…*. На экране появится диалог *Резервное копирование*:

source: Use the fields on the *File Options* tab to specify general information about the backup.
ru_ru: Воспользуйтесь полями на вкладке *Свойства файла*, чтобы задать общие свойства резервной копии.

source: Enter the name of the backup file in the *Filename* field. Optionally, use the browser button to navigate into a directory and select a file that will contain the archive.
ru_ru: Введите имя файла резервной копии в поле *Имя файла*. При желании вы можете воспользоваться кнопкой обзора для перехода в нужный каталог и выбора файла, в который будет помещён архив.

source: Use the drop-down listbox in the *Format* field to select the file format for the backup.
ru_ru: Воспользуйтесь выпадающем списком в поле *Формат*, чтобы выбрать формат резервной копии.

source: Use the *Compress Ratio* field to select a compression level for the backup. Specify a value of zero to mean use no compression; specify a maximum compression value of 9. Please note that tar archives do not support compression.
ru_ru: В поле *Степень сжатия* задаётся уровень сжатия для резервной копии. Нулевое значение в этом поле отключает сжатие, а 9 устанавливает максимальное сжатие. Заметьте, что архивы tar не поддерживают сжатие.

source: Use the *Encoding* drop-down listbox to select the encoding that should be used for the archive.
ru_ru: В поле *Кодировка* можно выбрать кодировку, в которой будет сохранено содержимое архива.

source: Use the *Number of Jobs* field (when applicable) to specify the number of tables that will be dumped simultaneously in a parallel backup.
ru_ru: В поле *Количество заданий* (когда это применимо) задаётся, сколько таблиц будет выгружаться одновременно в параллельном режиме.

source: When you've completed the *File Options* tab, navigate to the *Dump Options #1* tab:
ru_ru: Завершив определение параметров на вкладке *Свойства файла*, перейдите ко вкладке *Параметры выгрузки 1*:

source: Use the fields on the *Dump Options #1* tab to specify details about the type of objects that will be backed up:
ru_ru: Воспользуйтесь полями на вкладке *Параметры выгрузки 1*, чтобы определить, какие типы объектов будут выгружены в копию:

source: Use the checkboxes in the *Sections* box to select a portion of the object that will be backed up. By default, a backup will include all sections.
ru_ru: В группе флажков *Секции* можно определить, какие разделы объектов будут выгружаться. По умолчанию в копию включаются все разделы.

source: Check the box next to *Pre-data* to include all data definition items not included in the data or post-data item lists.
ru_ru: Отметьте флажок *Пред-данные*, чтобы включить в выгрузку все элементы, не относящиеся к данным и пост-данным.

source: Check the box next to *Data* to backup actual table data, large-object contents, and sequence values.
ru_ru: Отметьте флажок *Данные*, чтобы включить в копию собственно данные таблиц, содержимое больших объектов и значения последовательностей.

source: Check the box next to *Post-data* to include definitions of indexes, triggers, rules, and constraints other than validated check constraints.
ru_ru: Отметьте флажок *Пост-данные*, чтобы включить в копию определения индексов, триггеров, правил и ограничений, за исключением проверяемых ограничений-проверок.

source: Use the checkboxes in the *Type of Objects* box to select the objects that will be included in the backup. By default, all objects will be included in the backup.
ru_ru: Воспользуйтесь флажками в группе *Тип объектов*, чтобы выбрать, какие объекты будут включены в резервную копию. По умолчанию в копию включаются все объекты.

source: Check the box next to *Only data* to back up only the data.
ru_ru: Отметьте флажок *Только данные*, чтобы выгрузить в копию только данные, без схемы.

source: Check the box next to *Only schema* to back up only the schema (the data definitions).
ru_ru: Отметьте флажок *Только схема*, чтобы выгрузить только схему (определения данных).

source: Check the box next to *Blobs* to include large objects in the backup.
ru_ru: Отметьте флажок *Большие двоичные объекты*, чтобы включить в копию такие объекты.

source: Use the checkboxes in the *Don't Save* box to select the objects that will not be included in the backup.
ru_ru: Воспользуйтесь флажками в группе *Не сохранять*, чтобы выбрать объекты, которые не должны включаться в резервную копию.

source: Check the box next to *Owner* to omit commands that set object ownership.
ru_ru: Отметьте флажок *Владелец*, чтобы опустить команды, устанавливающие владение объектами.

source: Check the box next to *Privilege* to omit commands that create access privileges.
ru_ru: Отметьте флажок *Права*, чтобы опустить команды, устанавливающие права доступа.

source: Check the box next to *Tablespace* to omit tablespaces.
ru_ru: Отметьте флажок *Табличное пространство*, чтобы опустить табличные пространства.

source: Check the box next to *Unlogged* table data to omit the contents of unlogged tables.
ru_ru: Отметьте флажок *Данные нежурналируемых таблиц*, чтобы опустить содержимое нежурналируемых таблиц.

source: When you've completed the *Dump Options #1* tab, select the *Dump Options #2* tab:
ru_ru: Завершив настройку на вкладке *Параметры выгрузки 1*, перейдите на вкладку *Параметры выгрузки 2*:

source: Use the fields on the *Dump Options #2* tab to specify details about the statements used within the backup file.
ru_ru: Воспользуйтесь полями на вкладке *Параметры выгрузки 2*, чтобы определить, какие операторы будут использоваться в файле копии.

source: Use the checkboxes in the *Queries* box to specify the type of statements that should be included in the backup.
ru_ru: Воспользуйтесь флажками в группе *Запросы*, чтобы указать, какие операторы должны включаться в резервную копию.

source: Check the box next to *Include CREATE DATABASE* statement to include a command in the backup that creates a new database when restoring from the backup.
ru_ru: Отметьте флажок *Добавить CREATE DATABASE*, чтобы в резервную копию была добавлена команда, которая создаст новую базу данных при восстановлении из копии.

source: Check the box next to *Include DROP DATABASE* statement to include a command in the backup that drops any existing database before restoring from the backup.
ru_ru: Отметьте флажок *Добавить DROP DATABASE*, чтобы в резервную копию была добавлена команда, которая удалит существующую базу данных перед восстановлением из копии.

source: Check the box next to *Use Column Inserts* to dump the data in the form of INSERT statements, with explicit column names. Please note: this may make restoration from backup slow.
ru_ru: Отметьте флажок *INSERT с указанием столбцов*, чтобы данные выгружались в виде операторов INSERT, с явным указанием имён столбцов. Имейте в виду, что это может замедлить восстановление из резервной копии.

source: Check the box next to *Use Insert commands* to dump the data in the form of INSERT statements rather than using a COPY command. Please note: this may make restoration from backup slow.
ru_ru: Отметьте флажок *Использовать команды INSERT*, чтобы данные выгружались в виде операторов INSERT, а не с использованием команды COPY. Имейте в виду, что это может замедлить восстановление из резервной копии.

source: Use the checkboxes in the *Disable* box to specify the type of statements that should be excluded from the backup.
ru_ru: Воспользуйтесь флажками в группе *Выключить*, чтобы указать, какое поведение следует отключить при создании резервной копии.

source: Check the box next to *Trigger* (active when creating a data-only backup) to include commands that will disable triggers on the target table while the data is being loaded.
ru_ru: Отметьте флажок *Триггер* (он активен лишь при создании копии только данных), чтобы добавить команды, которые отключат триггеры в целевой таблице при загрузке данных.

source: Check the box next to *$ quoting* to disable dollar quoting within function bodies; if disabled, the function body will be quoted using SQL standard string syntax.
ru_ru: Отметьте флажок *Заключение в $*, чтобы предотвратить заключение тел функций в доллары; в этом случае тело функции будет заключаться в кавычки как обычные строки по стандарту SQL.

source: Use the checkboxes in the *Miscellaneous* box to specify miscellaneous backup options.
ru_ru: С помощью флажков в группе *Разное* вы можете задать дополнительные параметры резервного копирования.

source: Check the box next to *Use SET SESSION AUTHORIZATION* to include a statement that will use a SET SESSION AUTHORIZATION command to determine object ownership (instead of an ALTER OWNER command).
ru_ru: Отметьте флажок *Использовать SET SESSION AUTHORIZATION*, чтобы включить в выгрузку оператор, который будет задействовать команду SET SESSION AUTHORIZATION для установки владения объектами (вместо команды ALTER OWNER).

source: Check the box next to *With OIDs* to include object identifiers as part of the table data for each table.
ru_ru: Отметьте флажок *С OID*, чтобы для каждой таблицы в составе её данных выгружались идентификаторы объектов.

source: Check the box next to *Verbose messages* to instruct pg_dump to use verbose messages.
ru_ru: Отметьте флажок *Подробные сообщения*, чтобы pg_dump выводил более детальные сообщения.

source: Check the box next to *Force double quotes on identifiers* to force the quoting of all identifiers.
ru_ru: Отметьте флажок *Всегда заключать идентификаторы в кавычки*, чтобы в кавычки заключались все идентификаторы.

source: When you've completed the *Dump Options #2* tab, select the *Objects* tab:
ru_ru: Завершив настройку на вкладке *Параметры выгрузки 2*, перейдите на вкладку *Объекты*:

source: Use the fields on the *Objects* tab to select the objects that will be included in the backup; by default, when performing a database backup, all objects will be selected for inclusion in the archive. Deselect an object name to exclude that object from the archive.
ru_ru: Воспользуйтесь полями на вкладке *Объекты*, чтобы выделить объекты, которые войдут в резервную копию; по умолчанию при копировании базы данных в архив будут включены все объекты. Чтобы исключить какой-либо объект из архива, снимите отметку у его имени.

source: When you've specified the details that will be incorporated into the pg_dump command, click the *Backup* button to build and execute a command based on those preferences; the result will be displayed on the *Messages* tab:
ru_ru: Задав параметры резервного копирования, которые будут переданы команде pg_dump, нажмите кнопку *Резервная копия*, чтобы окончательно сформировать и выполнить эту команду; её результат можно будет увидеть на вкладке *Сообщения*:

source: If the backup is successful, the *Messages* tab will display:
ru_ru: Если создание резервной копии прошло успешно, на вкладке *Сообщения* будет выведено:

source: *Process returned exit code 0.*
ru_ru: *Процесс возвратил код выхода 0.*

source: Scroll up to review the pg_dump command used to generate the archive, or to view any error messages that were returned during the backup. When you're finished, click *Done* to exit the *Backup* dialog.
ru_ru: Прокрутите сообщения выше, чтобы увидеть, какая команда pg_dump запускалась для создания архива, или просмотреть сообщения об ошибках, выданные в процессе копирования. Закончив, нажмите кнопку *Готово*, чтобы закрыть диалог *Резервное копирование*.
