Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/bugreport.po
Languages: ru_ru

source: `Bug Reporting`:index:
ru_ru: `Как сообщить об ошибке`:index:

source: If you think you encountered a bug in pgAdmin III, please check the following:
ru_ru: Если вы думаете, что обнаружили ошибку в pgAdmin III, пожалуйста, проверьте следующее:

source: Is this behaviour expected? Have a look at the `FAQs <http://www.pgadmin.org/pgadmin3/faq/>`_.
ru_ru: Не является ли это поведением ожидаемым? Просмотрите `ответы на частые вопросы <http://www.pgadmin.org/pgadmin3/faq/>`_.

source: Is this bug already reported? Check the `known bugs <http://www.pgadmin.org/pgadmin3/bugs.php>`_.
ru_ru: Не сообщалось ли об этой ошибке ранее? Проверьте `список известных ошибок <http://www.pgadmin.org/pgadmin3/bugs.php>`_.

source: Are you running the latest version from the `website <http://www.postgresql.org/ftp/pgadmin3/release/>`_? If not, try the newest stuff.
ru_ru: Вы используете последнюю версию, имеющуюся на `сайте pgAdmin <http://www.postgresql.org/ftp/pgadmin3/release/>`_? Если нет, попробуйте её.

source: Ahh, so you've found a new one then?
ru_ru: А что же всё-таки делать, если это действительно новая ошибка?

source: Post your report to the `support mailing list <http://archives.postgresql.org/pgadmin-support/>`_, and include the following informations:
ru_ru: Отправьте отчёт об ошибке в `список рассылки по вопросам поддержки <http://archives.postgresql.org/pgadmin-support/>`_, и включите в отчёт следующую информацию:

source: Platform you're running on
ru_ru: Платформа, которую вы используете

source: Language
ru_ru: Язык

source: Distribution you used (source tarball, or binary)
ru_ru: Вариант используемого пакета (архив с исходным кодом или собранный двоичный пакет)

source: Version you tested
ru_ru: Проверенная вами версия

source: If possible and appropriate, include a backtrace from the crash. You may need to recompile wxWidgets and pgAdmin with the --enable-debug option to do this.
ru_ru: Если это возможно и уместно, включите в отчёт отладочный стек в момент сбоя. Для этого вам может понадобиться перекомпилировать wxWidgets и pgAdmin с ключом --enable-debug.

source: Please do **not** send an email directly to one of the programmers; they might miss it, or even be the wrong person altogether.
ru_ru: Пожалуйста, **не** посылайте письмо непосредственно кому-то из разработчиков; оно может остаться незамеченным и вы можете не знать, кому именно оно должно предназначаться.

source: Using the mailing list guarantees that your request isn't lost and will be answered in a timely fashion.
ru_ru: Обращение в список почтовой рассылки гарантирует, что ваш запрос не будет потерян, и вы получите ответ достаточно оперативно.

source: After a bug has been reported on the mailing list as being fixed, it might take one or two days until it has made it into the distribution tarballs, please be patient.
ru_ru: После того, как ошибка, о которой поступило сообщение в список рассылки, будет исправлена, включение исправленного кода в распространяемые пакеты может занять некоторое время, поэтому будьте терпеливы.

source: Thanks for giving pgAdmin3 a chance!
ru_ru: Спасибо, что дали шанс pgAdmin3!

source: *The pgAdmin Development Team*
ru_ru: *Команда разработчиков pgAdmin*
