Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/commandline.po
Languages: ru_ru

source: `Command Line Parameters`:index:
ru_ru: `Параметры командной строки`:index:

source: There are a number of command line options that may be passed to the pgAdmin executable when starting it.
ru_ru: Программа pgAdmin поддерживает набор параметров командной строки, которые можно передать ей при запуске.

source: **-h** Display command line option help.
ru_ru: **-h** Вывести справку по параметрам командной строки.

source: **-s <server description>** Auto connect to the specified server. <server description> is the description entered when you added the server to the treeview in pgAdmin, quoted if required. If multiple servers are registered with the same description, the first found will be auto-connected.
ru_ru: **-s <описание сервера>** Автоматически подключиться к заданному серверу. Здесь <описание сервера> — это описание, которое вы задали, когда регистрировали сервер в pgAdmin, заключённое в кавычки при необходимости. Если с одним описанием были зарегистрированы несколько серверов, произойдёт подключение к первому попавшемуся из них.

source: **-S** Open a :ref:`Server Status <status>` window upon connection. If used together with the **-s <server description>** option, the server status window will automatically be connected to this server. If used alone, a dialog box will appear prompting for the connection information. This switch cannot be used together with the **-Sc <connection string>** option.
ru_ru: **-S** Открыть при подключении окно :ref:`Состояние сервера <status>`. При использовании в сочетании с ключом **-s <описание сервера>** окно состояния сервера будет связано с сервером автоматического подключения. Если же этот ключ используется отдельно, на экране появляется диалоговое окно для ввода информации для подключения. Этот ключ несовместим с параметром **-Sc <строка подклчючения>**.

source: **-Sc <connection string>** Open a :ref:`Server Status <status>` window upon connection. The server status window will automatically be connected to the server specified in the connection string. This option cannot be used together with the **-S** switch.
ru_ru: **-Sc <строка подключения>** Открыть окно :ref:`Состояние сервера<status>` при подключении. Окно состояния сервера будет связано с сервером, заданным в строке подключения. Этот параметр несовместим с ключом **-S**.

source: **NOTE:** The "password" connection string option will not be recognised for security reasons. Please use a `PGPASSFILE <http://www.postgresql.org/docs/current/static/libpq.html#libpq-connect>`_ if you need to store the connection password.
ru_ru: **Замечание:** Параметр "password" (пароль) в строке подключения не будет принят из соображений безопасности. Если вам нужно сохранить пароль подключения, воспользуйтесь файлом `pgpass <http://www.postgresql.org/docs/current/static/libpq.html#libpq-connect>`_.

source: **-q** Open a :ref:`Query Tool <query>` window upon connection. If used together with the **-s <server description>** option, the query tool will automatically be connected to this server. If used alone, a dialog box will appear prompting for the connection information. This switch cannot be used together with the **-qc <connection string>** option.
ru_ru: **-q** Открыть :ref:`Запросник <query>` при подключении. При использовании в сочетании с ключом **-s <описание сервера>** запросник будет автоматически связан с сервером автоматического подключения. Если же этот ключ используется отдельно, на экране появляется диалоговое окно для ввода информации для подключения. Этот ключ несовместим с параметром **-qc <строка подклчючения>**.

source: **-qc <connection string>** Open a :ref:`Query Tool <query>` window upon connection. The query tool will automatically be connected to the server specified in the connection string. This option cannot be used together with the **-q** switch.
ru_ru: **-qc <строка подключения>** Открыть :ref:`Запросник <query>` при подключении. Запросник будет автоматически связан с сервером, указанным в строке подключения. Этот параметр несовместим с ключом **-q**.

source: **-f <SQL script>** Automatically open the specified SQL script in the :ref:`Query Tool <query>`. Only useful with -q or -qc.
ru_ru: **-f <SQL-скрипт>** Автоматически открывать заданный скрипт в :ref:`Запроснике <query>`. Полезен только в сочетании с -q или -qc.

source: **-ch <hba file>** Edit the specified pg_hba.conf config file.
ru_ru: **-ch <файл hba>** Редактировать указанный файл конфигурации pg_hba.conf.

source: **-cm <config file>** Edit the specified postgresql.conf config file.
ru_ru: **-cm <файл конфигурации>** Редактировать указанный файл конфигурации postgresql.conf.

source: **-cp <pgpass file>** Edit the specified .pgpass/pgpass.conf config file.
ru_ru: **-cp <файл pgpass>** Редактировать указанный файл конфигурации .pgpass/pgpass.conf.

source: **-c <dir>** Edit the config files in specified cluster directory.
ru_ru: **-c <каталог>** Редактировать файлы конфигурации в заданном каталоге кластера.

source: **-t** Start in dialogue translation test mode. This mode allows each dialogue to be viewed without running the application to assist with string translation.
ru_ru: **-t** Запустить в режиме проверки перевода диалогов. Этот режим позволяет просмотреть все диалоги, не запуская приложения, что полезно при переводе строк интерфейса.
