Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/connect-error.po
Languages: ru_ru

source: `Connection errors`:index:
ru_ru: `Ошибки подключения`:index:

source: When connecting to a PostgreSQL server, you might get error messages that need some more explanations. If you encounter them, please read the following information carefully, we're sure they will help you.
ru_ru: При попытке подключения к серверу PostgreSQL вы можете получать сообщения об ошибках, требующие дополнительных разъяснений. Если вы столкнётесь с ними, пожалуйста, внимательно прочитайте следующую информацию — мы уверены, что она будет вам полезна.

source: `notrunning`_
ru_ru: :ref:`notrunning`

source: `no-hba`_
ru_ru: :ref:`no-hba`

source: could not connect to Server: Connection refused
ru_ru: Не удалось подключиться к серверу: В соединении отказано

source: If this message appears, there are two possible reasons for this: either the server isn't running at all. Simply start it.
ru_ru: Если появляется это сообщение, оно может быть вызвано несколькими причинами. Первая — сервер вообще не запущен. В этом случае просто запустите его.

source: The other non-trivial cause for this message is that the server isn't configured to accept TCP/IP requests on the address shown.
ru_ru: Вторая, нетривиальная причина — сервер не настроен для того, чтобы принимать запросы TCP/IP по заданному адресу.

source: For security reasons, a PostgreSQL server "out of the box" doesn't listen on TCP/IP ports. Instead, it has to be enabled to listen for TCP/IP requests. This can be done by adding **tcpip = true** to the postgresql.conf file for Versions 7.3.x and 7.4.x, or **listen_addresses='*'** for Version 8.0.x and above; this will make the server accept connections on any IP interface.
ru_ru: Из соображений безопасности сервер PostgreSQL «из коробки» не открывает порты TCP/IP для приёма соединений. Чтобы он принимал соединения по TCP/IP, это нужно явно разрешить. Это можно сделать, добавив в файл postgresql.conf **tcpip = true** для версий 7.3.x и 7.4.x или **listen_addresses='*'** для версии 8.0.x и выше; в результате сервер будет принимать подключения через любые IP-интерфейсы.

source: For further information, please refer to the PostgreSQL documentation about `runtime configuration <http://www.postgresql.org/docs/current/interactive/runtime-config.html>`_.
ru_ru: За дополнительными сведениями обратитесь к документации PostgreSQL, разделу, посвящённому `конфигурации времени выполнения <https://postgrespro.ru/docs/postgresql/current/runtime-config.html>`_.

source: FATAL: no pg_hba.conf entry
ru_ru: ВАЖНО: в pg_hba.conf нет записи

source: If this message appears, your server can be contacted correctly over the network, but isn't configured to accept your connection. Your client isn't detected as a legal user for the database.
ru_ru: Если выводится это сообщение, с сервером можно связаться по сети, но он не принимает ваше подключение. Вашему клиентскому компьютеру или пользователю не разрешён доступ к базе данных.

source: You will have to add an entry in the form **host template1 postgres 192.168.0.0/24 md5** for IPV4 or **host template1 postgres ::ffff:192.168.0.0/120 md5** for IPV6 networks to the pg_hba.conf file.
ru_ru: Для решения этой проблемы в файл pg_hba.conf нужно добавить запись вида **host template1 postgres 192.168.0.0/24 md5** для сетей IPV4 или **host template1 postgres ::ffff:192.168.0.0/120 md5** для IPV6.

source: For further information, please refer to the PostgreSQL documentation about `client authentication <http://www.postgresql.org/docs/current/interactive/client-authentication.html>`_.
ru_ru: За дополнительными сведениями обратитесь к документации PostgreSQL, разделу `Аутентификация клиентского приложения <https://postgrespro.ru/docs/postgresql/9.6/client-authentication.html>`_.
