Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/connect.po
Languages: ru

source: `Connect to server`:index:
ru: `Подключение к серверу`:index:

source: Use this dialog to add a new server connection to the pgAdmin tree.
ru: Воспользуйтесь этим диалогом, чтобы добавить новое подключение к серверу в дерево pgAdmin.

source: If you're experiencing connection problems, check the :ref:`connection problems <connect-error>`.
ru: Если вы столкнулись с проблемами при подключении, просмотрите раздел :ref:`Ошибки подключения <connect-error>`.

source: The name is a text to identify the server in the pgAdmin tree.
ru: В поле *Имя* задаётся произвольный текст для идентификации сервера в дереве pgAdmin.

source: The host is the IP address of the machine to contact, or the fully qualified domain name. On Unix based systems, the address field may be left blank to use the default PostgreSQL Unix Domain Socket on the local machine, or be set to an alternate path containing a PostgreSQL socket. If a path is entered, it must begin with a "/". The port number may also be specified.
ru: В поле *Компьютер* задаётся IP-адрес или полное доменное имя компьютера, к которому нужно подключиться. В системах на базе Unix это поле можно оставить пустым, чтобы использовать стандартный для PostgreSQL путь к доменному сокету Unix на локальном компьютере, или задать в нём другой путь к сокету PostgreSQL. Если вводится этот путь, он должен начинаться с «/». Также может быть задан номер порта.

source: The service field is the name of a service configured in the pg_service.conf file. For details, see the `pg_service documentation <http://www.postgresql.org/docs/9.0/interactive/libpq-pgservice.html>`_.
ru: В поле *Служба* задаётся имя службы PostgreSQL, настроенное в файле pg_service.conf. За подробностями обратитесь к `документации pg_service <https://postgrespro.ru/docs/postgresql/current/libpq-pgservice.html>`_.

source: The maintenance DB field is used to specify the initial database that pgAdmin connects to, and that will be expected to have the :ref:`pgAgent <pgagent>` schema and :ref:`adminpack <extend>` objects installed (both optional). On PostgreSQL 8.1 and above, the maintenance DB is normally called 'postgres', and on earlier versions 'template1' is often used, though it is preferrable to create a 'postgres' database for this purpose to avoid cluttering the template database.
ru: Поле *Служебная БД* применяется для указания базы данных, к которой pgAdmin будет подключаться изначально, и ожидается, что в этой базе будут установлены схема :ref:`pgAgent <pgagent>` и объекты :ref:`adminpack <extend>` (хотя это необязательно). В PostgreSQL 8.1 и новее служебная БД обычно называется «postgres», а в более ранних часто использовалась «template1», хотя и в старых версиях предпочтительнее для этой цели создать базу данных «postgres», чтобы не замусоривать шаблонную базу.

source: If you select "Store password", pgAdmin stores passwords you enter in the ~/.pgpass file under Unix or :file:%APPDATA%\postgresql\pgpass.conf under Win32 for later reuse. For details, see `pgpass documentation <http://www.postgresql.org/docs/current/interactive/libpq-pgpass.html>`_. It will be used for all libpq based tools. If you want the password removed, you can select the server's properties and uncheck the selection any time.
ru: Если вы отметите флажок *Сохранять пароль*, pgAdmin будет сохранять введённый вами пароль в файле ~/.pgpass в системах Unix или в :file:%APPDATA%\postgresql\pgpass.conf в Win32 для последующего использования. За подробностями обратитесь к `документации pgpass <https://postgrespro.ru/docs/postgresql/current/libpq-pgpass.html>`_. Сохранённый пароль будет использоваться всеми программами на базе libpq. Если вам захочется удалить пароль, вы сможете в любое время открыть свойства сервера и убрать этот флажок.

source: The colour field allows you to set a specific colour for this server. This colour will be used in the background of the tree where each object of this server is displayed.
ru: Поле *Цвет* позволяет выбрать определённый цвет для сервера. Выбранный цвет будет цветом фона при отображении в дереве объектов этого сервера.

source: The Group field is used to push your server in a specific group. You can have a production group, and a test group. Or LAN specific groups. It's completely up to you. But it helps when you have lors of server to register.
ru: В поле *Группа* вы можете привязать сервер к определённой группе. Например, вы можете определить производственную и тестовую группы, а также группы по сетям. Но это будет полезно, только если вам нужно регистрировать множество серверов.

source: The second tab has all the SSL specific options: what kind of SSL connection you want, your root certificate file, your server CRL, your client certificate file, and finally your client key file.
ru: На второй вкладке определяются все параметры, связанные с SSL: желаемый вариант SSL-подключения, файл корневых сертификатов, список отзыва сертификатов, ваш файл сертификата клиента и, наконец, файл ключа клиента.

source: You can use the "SSH Tunneling" tab to connect pgAdmin (through an intermediary proxy host) to a server that resides on a network to which the client may not be able to connect directly.
ru: Воспользовавшись вкладкой *SSH-туннель*, можно подключить pgAdmin (через промежуточный прокси) к серверу, расположенному в сети, к которой клиент не имеет непосредственного доступа.

source: Check the box next to "Use SSH tunneling?" to specify thatpgAdmin should use an SSH tunnel when connecting to the specified server.
ru: Установите флажок *Использовать SSH-туннель*, чтобы указать, что gAdmin должен подключаться к данному серверу через SSH-туннель.

source: Specify the name or IP address of the SSH host (through which client connections will be forwarded) in the *Tunnel host* field.
ru: Укажите имя или IP-адрес SSH-сервера (через который клиент будет устанавливать подключение) в поле *Сервер тоннеля*.

source: Specify the name of a user with connection privileges for the SSH host in the *Username* field.
ru: Задайте имя пользователя, которому разрешено подключение к серверу SSH в поле *Имя пользователя*.

source: Specify the type of authentication that will be used when connecting to the SSH host in the *Authentication* field.
ru: Выберите тип проверки подлинности, которую будет проходить клиент при подключении к серверу SSH в поле *Аутентификация*.

source: Select the radio button next to *Password* to specify that pgAdmin will use a password for authentication by the SSH host. This is the default.
ru: Отметьте пункт *Пароль*, чтобы указать, что для проверки подлинности на сервере SSH будет применяться пароль. (Это вариант по умолчанию.)

source: Select the radio button next to *Identity file* to specify that pgAdmin will use a private key file when connecting.
ru: Отметьте пункт *Файл идентификации*, чтобы указать, что для проверки подлинности на сервере SSH будет применяться файл с закрытым ключом.

source: If the SSH host is expecting a private key file for authentication, use the *Identity file* field to specify the location of the key file.
ru: Если для прохождении проверки подлинности на сервере SSH требуется закрытый ключ, укажите расположение файла с ключом в поле *Файл идентификации*.

source: If the SSH host is expecting a password, use the *Password/Passphrase* field to specify a the password, or if an identity file is being used, specify the passphrase.
ru: Если сервер SSH требует предъявить пароль, задайте его в поле *Пароль/секретная фраза*, или если используется файл ключа, задайте в этом поле пароль для него.

source: The fourth tab contains some advanced options that are seldomly used.
ru: На четвёртой вкладке содержатся редко используемые параметры.

source: The "Connect now?" field makes pgAdmin attempt a connection as soon as you hit the OK button.
ru: Если флажок *Подключиться сейчас* установлен, pgAdmin попытается установить подключение сразу после нажатия кнопки OK.

source: You can unckeck the "Connect now" checkbox if you don't want the connection to the server being established immediately, but only registered for later use. In this case, the connection parameters won't be validated.
ru: Вы можете снять флажок *Подключиться сейчас*, если хотите, чтобы подключение не было установлено немедленно, а только сохранилось для последующего использования. В этом случае параметры подключения останутся непроверенными.

source: The "Restore env?" option determines whether or not pgAdmin will attempt to restore the browser environment when you reconnect to this server. If you regularly use different databases on the same server you might want to turn this option off.
ru: Параметр *Восстанавливать окружение?* определяет, будет ли pgAdmin пытаться восстанавливать окружение обозревателя объектов при последующих подключениях к серверу. Если вы обычно работаете на одном сервере с разными базами, возможно, имеет смысл отключить его.

source: The Rolename field allows you to connect as a role, and then get the permissions of another one (the one you specified in this field). The connection role must be a member of the rolename.
ru: Воспользовавшись полем *Имя роли*, вы можете подключаться к серверу с одной ролью, а затем переключаться на другую (ту, что указана в этом поле). Роль, подключающаяся к серверу, должна быть членом данной.

source: The DB restriction field allows you to enter an SQL restriction that will be used against the `pg_database <http://www.postgresql.org/docs/current/interactive/catalog-pg-database.html>`_ table to limit the databases that you see. For example, you might enter: *'live_db', 'test_db'* so that only live_db and test_db are shown in the pgAdmin browser. Note that you can also limit the schemas shown in the database from the Database properties dialogue by entering a restriction against `pg_namespace <http://www.postgresql.org/docs/current/interactive/catalog-pg-namespace.html>`_.
ru: В поле *Ограничение баз данных* вы можете задать SQL-ограничение для содержимого таблицы `pg_database <https://postgrespro.ru/docs/postgresql/current/catalog-pg-database.html>`_, чтобы сократить множество выводимых баз данных. Например, вы можете ввести: *'live_db', 'test_db'*, чтобы в обозревателе pgAdmin показывались только базы live_db и test_db. Заметьте, что вы также можете ограничить схемы в базе данных, открыв диалог свойств базы и введя в нём ограничение для `pg_namespace <https://postgrespro.ru/docs/postgresql/current/catalog-pg-namespace.html>`_.

source: The "Service ID" field specifies parameters to control the database service process. Its meaning is operating system dependent.
ru: В поле *ID службы* задаются параметры для управления процессом, обслуживающим БД. Его значение зависит от операционной системы.

source: If pgAdmin is running on a Windows machine, it can control the postmaster service if you have enough access rights. Enter the name of the service. In case of a remote server, it must be prepended by the machine name (e.g. PSE1\pgsql-8.0). pgAdmin will automatically discover services running on your local machine.
ru: Если pgAdmin работает в системе Windows, он может управлять службой postmaster при наличии необходимых прав. В данном случае в этом поле задаётся имя службы, а если сервер — удалённый, то имя службы предваряется именем компьютера (например, PSE1\pgsql-8.0). Службы, работающие локально, pgAdmin обнаружит автоматически.

source: If pgAdmin is running on a Unix machine, it can control processes running on the local machine if you have enough access rights. Enter a full path and needed options to access the pg_ctl program. When executing service control functions, pgAdmin will append status/start/stop keywords to this. Example::
ru: Если pgAdmin работает в системе Unix, он может управлять локальными процессами при наличии необходимых прав. В данном случае введите в этом поле полный путь и необходимые параметры для программы pg_ctl. Осуществляя управление службой, pgAdmin будет добавлять к этой команде слова status/start/stop. Например::

source: This dialog can be launched at a later time to correct or add parameters by executing "properties" when the server is selected. You should not be connected to it if you want to make changes on its properties.
ru: Этот диалог можно открыть позднее, чтобы просмотреть, исправить или добавить параметры, выбрав в контекстном меню для выделенного сервера *Свойства*. Если вы хотите изменять свойства сервера, вы не должны быть подключены к нему.

source: Contents:
ru: Содержание:
