Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/editgrid.po
Languages: ru_ru

source: `Edit Data`:index:
ru_ru: `Редактирование данных`:index:

source: The Edit Grid tool allows you to view the data that's stored in a table or view, and to edit the content if technically possible.
ru_ru: Средство редактирования данных позволяет вам просматривать данные, содержащиеся в таблице или представлении, а также редактировать их, если это технически возможно.

source: The header of the grid will show the name of each column, together with the data type. A column that's part of the primary key will additionally be marked with [PK].
ru_ru: В заголовке таблицы показываются имена всех столбцов, вместе с их типами данных. Столбец, являющийся частью первичного ключа, будет дополнительно помечен как [PK] (Primary Key).

source: **Important:** In order to edit the data, each row in the table must be uniquely identifiable. This can be done using the OID, or a primary key. If none of them exist, the table is read only. Note that views can't be edited and are read only by design; updatable views (using rules) are not supported at this time.
ru_ru: **Важно:** Чтобы данные можно было редактировать, необходима возможность однозначно идентифицировать каждую строку в таблице. Это можно сделать по OID или по первичному ключу. Если в таблице нет ни того, ни другого, она будет доступна только для чтения. Заметьте, что представления нельзя редактировать и они по природе своей доступны только для чтения; изменяемые представления (реализованные с применением правил) в данное время не поддерживаются.

source: To change the value of a field, you select that field and enter the new text. The Store toolbar button allows the data to be written back to the server. The row will be written automatically, if you select a different row.
ru_ru: Чтобы изменить значение поля, выделите это поле и введите новый текст. Кнопка *Сохранить* на панели инструментов позволяет отправить данные серверу для записи. Также данные будут сохраняться автоматически при переходе к другой строке.

source: To enter a new row into the table, you enter the data into the last row that has a row number marked with an asterisk. As soon as you store the data, the row will get a row number, and a fresh empty asterisk line is created.
ru_ru: Чтобы добавить в таблицу новую строку, начните вводить данные в последнюю строку, в которой номер строки помечен звёздочкой. Как только вы сохраните данные, эта строка получит номер и будет создана новая строка со звёздочкой.

source: If an SQL NULL is to be written to the table, simply leave the field empty. If you store a new row, this will let the server fill in the default value for that column. If you store a change to an existing row, the value NULL will explicitly be written.
ru_ru: Когда в таблицу нужно записать SQL-значение NULL, просто оставьте это поле пустым. Если вы оставите пустым столбец в новой строке, сервер может подставить для него значение по умолчанию, а если вы сохраните такое изменение в существующей строке, в этот столбец явно запишется значение NULL.

source: To enter a newline into a field, press Ctrl-Enter.
ru_ru: Чтобы ввести в поле символ перевода строки, нажмите Ctrl-Enter.

source: If you want pgAdmin III to write an empty string to the table, you enter the special string '' (two single quotes) in the field. If you want to write a string containing solely two single quotes to the table, you need to escape these quotes, by typing \'\'
ru_ru: Если вы хотите, чтобы pgAdmin III записал в поле таблицы пустую строку, введите в него специальную строку '' (два апострофа). Если же вы хотите ввести строку, содержащую именно два апострофа, их нужно экранировать, введя \'\'.

source: To delete a row, press the Delete toolbar button.
ru_ru: Чтобы удалить строку, нажмите кнопку *Удалить* на панели инструментов.

source: The Refresh toolbar button allows to reread the contents of the table, refreshing the display.
ru_ru: Кнопка *Обновить* на панели инструментов позволяет перечитать содержимое таблицы и обновить отображаемые данные.

source: You can select one or more rows, and copy them with Ctrl-C or the Copy toolbar button to the clipboard.
ru_ru: Вы можете выделить одну или несколько строк и скопировать их с помощью клавиш Ctrl-C или кнопки *Копировать* на панели инструментов в буфер обмена.

source: The Sort/Filter toolbar button will open the :ref:`View Data Options <gridopts>` dialog.
ru_ru: Кнопка *Сортировка/Фильтрация* открывает диалог :ref:`Параметры просмотра данных <gridopts>`.

source: The context menu can also be used to quick-sort or quick-filter the data set. When a cell in the grid is right-clicked, the following options allow the user to selectively view the data:
ru_ru: В контекстном меню также можно выбрать вариант быстрой сортировки или быстрой фильтрации набора данных. Щёлкнув ячейку правой кнопкой, можно вызвать контекстное меню со следующими вариантами выборочного просмотра данных:

source: *Filter by Selection*: When selected, refreshes the data set and displays only those rows whose column value matches the value in the cell currently selected.
ru_ru: *Фильтр по выделению*: при выборе этого пункта набор данных обновляется и на экране остаются только те строки, в которых значение текущего столбца соответствует значению в выбранной ячейке.

source: *Exclude by Selection*: When selected, refreshes the data set and excludes those rows whose column value matches the value in the cell currently selected.
ru_ru: *Фильтр исключающего выбора*: при выборе этого пункта набор данных обновляется и с экрана исчезают те строки, в которых значение текущего столбца соответствует значению в выбранной ячейке.

source: *Remove Filter*: When selected, removes all selection / exclusion filter conditions.
ru_ru: *Удалить фильтр*: при выборе этого пункта убираются все условия фильтра выделения/исключения.

source: *Sort Ascending*: When selected, refreshes the data set and displays the currently selected rows in the ascending order of the selected column values. If a sorting preference is already present for this data set, this sorting preference is appended to the current sort order.
ru_ru: *По возрастанию*: при выборе этого пункта набор данных обновляется и текущие строки сортируются по порядку возрастания значений в выбранном столбце. Если для этого набора данных уже установлен некоторый порядок сортировки, к нему будет добавлен текущий.

source: *Sort Descending*: When selected, refreshes the data set and displays the currently selected rows in the descending order of the selected column values. If a sorting preference is already present for this data set, this sorting preference is appended to the current sort order.
ru_ru: *По убыванию*: при выборе этого пункта набор данных обновляется и текущие строки сортируются по порядку убывания значений вы выбранном столбце. Если для этого набора данных уже установлен некоторый порядок сортировки, к нему будет добавлен текущий.

source: *Remove Sorting*: When selected, removes all sorting preferences for this data set.
ru_ru: *Убрать сортировку*: при выборе этого пункта все условия сортировки убираются.

source: **Note:** If a column is already selected for sorting, it's position in the sort list will remain the same, only the direction will be changed.
ru_ru: **Примечание:** Если столбец уже выбран для сортировки, его позиция в списке сортировки остаётся прежней, изменяется только направление.

source: Contents:
ru_ru: Содержание:
