Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/extend.po
Languages: ru_ru

source: `Extended features`:index:
ru_ru: `Расширенные функции`:index:

source: pgAdmin III's functionality can be further enhanced using the *adminpack* contrib module for PostgreSQL. This is a library of additional functions that may be installed on your server which allows pgAdmin to offer additional features, such as:
ru_ru: Функциональность pgAdmin III можно дополнительно расширить, используя модуль *adminpack*, входящий в набор contrib для PostgreSQL. Это библиотека дополнительных функций, которую можно установить на сервере, чтобы pgAdmin предоставлял такие расширенные возможности как:

source: The sizes on disk of tablespaces, databases, tables and indexes are displayed on the Statistics tab in the :ref:`main window <main>`.
ru_ru: Отображение размера табличных пространств, баз данных, таблиц и индексов на вкладке *Статистика* в :ref:`основном окне <main>`.

source: The :ref:`Status dialogue <status>` should be able to display the server logfiles (if logging is appropriately configured).
ru_ru: Вывод содержимого журналов сервера в :ref:`диалоге Состояние <status>` (если ведение журнала настроено).

source: Running queries from other users may be cancelled from the :ref:`Status dialogue <status>`.
ru_ru: Возможность отмены запросов, выполняемых другими пользователями, в диалоге :ref:`Состояние <status>`.

source: The server's configuration files postgresql.conf and pg_hba.conf may be editted, and reloaded remotely.
ru_ru: Возможность редактирования и удалённой перезагрузки файлов конфигурации сервера postgresql.conf и pg_hba.conf.

source: The adminpack is installed and activated by default if you are running the 'official' pgInstaller distribution of PostgreSQL for Windows and is included as a contrib module with all versions of PostgreSQL 8.2 and above. However, if you are running any other version of PostgreSQL you will need to manually install it. To do so, simply copy the appropriate adminpack source code to the /contrib directory of your pre-configured PostgreSQL source tree. You can download the adminpacks `here <http://www.pgadmin.org/download/adminpacks.php>`_.
ru_ru: Расширение adminpack устанавливается и активируется по умолчанию, если вы используете «официальный» дистрибутив pgInstaller из сборки PostgreSQL для Windows, либо распространяется как модуль contrib со всеми версиями PostgreSQL 8.2 и новее. Однако, если вы используете какую-либо другую версию PostgreSQL, вы должны вручную установить его. Для этого просто скопируйте исходный код adminpack в каталог /contrib предварительно сконфигурированного дерева исходного кода PostgreSQL. Загрузить пакеты adminpack вы можете `отсюда <http://www.pgadmin.org/download/adminpacks.php>`_.

source: Run the following commands (substituting *admin* for *admin81* if required)::
ru_ru: Выполните следующие команды (подставив *admin81* вместо *admin*, если требуется)::

source: The module should now be built, and installed into your existing PostgreSQL installation. To be used, you must now install the module into the database you use as pgAdmin's *Maintenance DB* (normally *postgres*, though you may wish to use a different database). To do so, locate the *admin.sql* or *admin81.sql* file installed in the previous step - normally this may be found in /usr/local/pgsql/share/contrib/ and run it against your database. You will normally need to do this as the PostgreSQL superuser::
ru_ru: В результате этот модуль должен быть собран и установлен в существующую инсталляцию PostgreSQL. Чтобы начать его использовать, теперь вы должны установить его в базу данных, которую вы выбрали в pgAdmin как *Служебную БД* (обычно *postgres*, хотя можно выбрать и другую). Для этого найдите файл *admin.sql* или *admin81.sql*, установленный на предыдущем этапе — обычно он находится в /usr/local/pgsql/share/contrib/ и запустите его в вашей базе. Как правило, для этого нужно от имени суперпользователя PostgreSQL сделать следующее::

source: The next time you connect to the server with pgAdmin, it will detect the presence of the adminpack and offer full functionality.
ru_ru: Когда pgAdmin подключится к серверу после этого, он обнаружит функции adminpack и предложит полную функциональность.

source: Since PostgreSQL 9.1, you don't need to use psql. You can manually add adminpack extension or make pgAdmin do the same by clicking on the "Fix It!" button of the guru hint.
ru_ru: Начиная с версии PostgreSQL 9.1, использовать psql не нужно. Вы можете вручную добавить расширение adminpack или сказать pgAdmin сделать это, нажав кнопку "Исправить это!" в диалоге подсказки гуру.
