Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/main.po
Languages: ru_ru

source: `pgAdmin Main Window`:index:
ru_ru: `Основное окно pgAdmin`:index:

source: In the main window, the structure of the databases is displayed. You can create new objects, delete and edit existing objects if the privileges of the user that you are using on the current connection to the database allow this.
ru_ru: В основном окне показывается структура баз данных. В нём вы можете создавать новые объекты или удалять и изменять существующие, если это позволяют права пользователя БД, с именем которого вы установили подключение к базе.

source: The left side of the main window shows a tree with all servers, and the objects they contain.
ru_ru: Слева в основном окне показывается дерево со всеми зарегистрированными серверами и содержащимися в них объектами.

source: The upper right side shows details of the object currently selected in the tree. Some objects might have statistics in addition to their properties, these can be shown if you select the Statistics tab.
ru_ru: В правой верхней части окна показываются свойства объекта, выделенного в дереве в данный момент. С некоторыми объектами связаны не только свойства, но и статистическая информация, которую можно увидеть на вкладке «Статистика».

source: The lower right side contains a reverse engineered SQL script. You can copy this to any editor using cut & paste, or save it to a file using Save definition... from the File menu, or use it as a template if you select the :ref:`Query Tool <query>`. If the :ref:`Copy SQL from main window to query tool <options-query_tool>` option is selected, the SQL query will be copied automatically to the tool.
ru_ru: В правой нижней части содержится восстановленный SQL-скрипт объекта. Вы можете скопировать его в любой редактор, воспользовавшись буфером обмена, либо сохранить в файл, выбрав в меню «Файл → Сохранить определение...», либо использовать его как шаблон в :ref:`Запроснике <query>`. Если установлено свойство :ref:`Копировать SQL из основного окна в запросник <options-query_tool>`, данный SQL-запрос будет автоматически скопирован в окно запросника.

source: The status line will show you some status information, as well as the time the last action took pgAdmin III to complete.
ru_ru: В строке состояния вы увидите некоторую информацию о состоянии программы, а также продолжительность последнего действия, выполненного программой pgAdmin III.

source: You can resize the main window, and change the sizes of the three main regions as you prefer. These adjustments will be preserved when you exit the program.
ru_ru: Вы можете изменить размер как самого окна, так и трёх его областей, как вам удобно. При перезапуске программы изменённые размеры будут сохранены.

source: pgAdmin is bandwidth friendly. The status of objects in the browser is only refreshed on request or after changes made with the built-in tools. Be aware that this does not cover changes made via manual SQL or from other users or other clients. It is generally advisable to manually refresh objects before working on them in such environments.
ru_ru: pgAdmin старается не нагружать сеть. Состояние объектов в окне обзора обновляется только по запросу или после изменений, произведённых встроенными средствами программы. Учтите, что это не касается изменений, производимых произвольными SQL-запросами или другими пользователями (на других компьютерах). В таких ситуациях обычно рекомендуется вручную обновлять объекты, прежде чем работать с ними.

source: Getting started
ru_ru: Начало работы

source: After you have added the desired server(s) to the tree on the left side using the :ref:`Add server <connect>` menu or toolbar button, each server will show up under the top node "Servers".
ru_ru: Когда вы добавите нужные серверы (или сервер) в левую панель, воспользовавшись пунктом меню :ref:`Добавить сервер... <connect>` или кнопкой на панели инструментов, все эти серверы появятся под узлом «Серверы».

source: To open a connection to a server, select the desired server in the tree, and double click on it or use Connect from the Tools menu. The connection will be established, and the properties of the top level objects are retrieved from the database server. If you've been connected to that database previously, pgAdmin III will restore the previous selection of database and schema for you. The current situation is saved when exiting the program, so that pgAdmin III is able to restore the previous environment.
ru_ru: Чтобы установить подключение к серверу, выберите его в дереве и дважды щёлкните его или воспользуйтесь пунктом меню «Инструменты → Подключиться». При этом будет установлено подключение к серверу и с него будут получены свойства объектов верхнего уровня. Если вы подключались к его базе данных ранее, pgAdmin III автоматически восстановит предыдущий выбор базы данных и схемы, благодаря тому, что он сохраняет текущее окружение при выходе.

source: Using the menu or toolbar buttons, you can create new objects, delete objects and edit properties of existing objects if the user that you entered when adding the server connection has sufficient privileges. You may find some options grayed out if displaying properties. This means, that the database server you're currently using doesn't support the feature, or that this property can't be changed by design, or that your user privileges won't allow you to change it.
ru_ru: Используя меню или кнопки на панели инструментов, вы можете создавать новые объекты, удалять существующие или изменять их свойства, если пользователь, которого вы указали при регистрации подключения к серверу, имеет достаточные для этого привилегии. Когда вы будете просматривать свойства, некоторые из них могут быть серыми, то есть неизменяемыми. Это может означать, что используемый вами сервер баз данных не поддерживает эту функцию или что это свойство нельзя менять по определению или что ваш пользователь не имеет права изменять его.

source: You can search for objects in the database using the :ref:`Search Tool <search_object>`
ru_ru: Вы можете искать объекты в базе данных, используя :ref:`Поиск объектов <search_object>`.

source: Contents:
ru_ru: Содержание:
