Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/maintenance.po
Languages: ru_ru

source: `Maintain a database object`:index:
ru_ru: `Обслуживание объекта базы данных`:index:

source: This tool allows to maintain the database in total, or only a selected table, or a selected index.
ru_ru: Это средство позволяет выполнить операцию обслуживания базы данных в целом, только отдельной таблицы или отдельного индекса.

source: Maintenance comes in three flavors.
ru_ru: Операции обслуживания имеют три разновидности.

source: VACUUM will scan the database or table for rows, that are not in use any more. If a row is updated or deleted, the previous content isn't replaced, but rather marked invalid. The new data is inserted freshly into the database. You need to perform a garbage collection regularly, to insure that your database doesn't contain too much unused data, wasting disk space and ultimately degrading performance.
ru_ru: Операция VACUUM сканирует базу данных или таблицу в поиске строк, которые больше не используются. Когда строка изменяется или удаляется, предыдущее её содержимое не заменяется, а просто помечается как неактуальное. Когда в базу вставляются новые данные, они помещаются в новые строки. Поэтому, чтобы ваша данных не содержала слишком много ставших ненужными данных, что чревато чрезмерным увеличением её объёма и снижением быстродействия, необходимо регулярно производить операцию очистки (VACUUM).

source: Please press the Help button to see the PostgreSQL help about the VACUUM command to learn more about the options.
ru_ru: Чтобы узнать больше о возможностях очистки, нажмите кнопку *Справка* и для вас откроется раздел документации PostgreSQL, посвящённый команде VACUUM.

source: The output of the database server is displayed in the messages page as they arrive. If Verbose is selected, the server will send very detailed info about what it did.
ru_ru: Сообщения, поступающие от сервера в процессе выполнения операции, будут выводиться на панели сообщений. Если отмечена галочка *Подробные сообщения*, сервер будет выдавать очень детальную информацию о производимой операции.

source: While this tool is very handy for ad-hoc maintenance purposes, you are encouraged to install an automatic job, that performs a VACUUM job regularly to keep your database in a neat state.
ru_ru: Хотя это средство очень удобно для обслуживания от случая к случаю, мы рекомендуем настроить автоматическое задание, которое будет регулярно производить очистку (VACUUM) для поддержания базы данных в хорошем состоянии.

source: ANALYZE investigates statistical values about the selected database or table. This enables the query optimizer to select the fastest query plan, to give optimal performance. Every time your data is changing radically, you should perform this task. It can be included in a VACUUM run, using the appropriate option.
ru_ru: Операция ANALYZE собирает статистическую информацию о выбранной базе данных или таблице. Это позволяет оптимизатору запросов выбирать лучший план выполнения для достижения максимальной производительности. Эту операцию следует выполнять каждый раз, когда ваши данные значительно меняются. Это действие может выполняться в процессе операции VACUUM, если установить соответствующий параметр.

source: REINDEX rebuilds the indexes in case these have degenerated caused by unusual data patterns inserted. This can happen for example if you insert many rows with increasing index values, and delete low index values.
ru_ru: Операция REINDEX перестраивает индексы, когда они оказываются неэффективными из-за добавления данных с необычным распределением. Например, это может иметь место, если вы вставите множество строк с увеличивающимися значениями индекса, а затем удалите значения с меньшими значениями.

source: The RECREATE option doesn't call the REINDEX SQL command internally, instead it drops the existing table and recreates it according to the current index definition.This doesn't lock the table exclusively, as REINDEX does, but will lock write access only.
ru_ru: Операция RECREATE не вызывает внутри SQL-команду REINDEX, а удаляет существующий индекс и пересоздаёт его согласно текущему определению. Это позволяет не устанавливать исключительную блокировку таблицы, как это делает REINDEX, но всё же влечёт блокировку записи в таблицу.
