Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/openssl.po
Languages: ru_ru

source: The OpenSSL Licence
ru_ru: Лицензия OpenSSL

source: pgAdmin uses code from the OpenSSL project to provide support for SSL encrypted connections. The OpenSSL licence is included below:
ru_ru: pgAdmin использует код из проекта OpenSSL для обеспечения поддержки шифрованных SSL-соединений. Лицензия на OpenSSL включена ниже:

source: **Copyright (c) 1998-2011 The OpenSSL Project. All rights reserved.**
ru_ru: **Авторские права © 1998—2011 Проект OpenSSL. Все права защищены.**

source: Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
ru_ru: Вторичное распространение и использование в исходной и двоичной формах, без или с модификациями, разрешено с условием соблюдения следующих условий:

source: Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
ru_ru: При вторичном распространении исходного кода должно сохраняться вышеприведённое уведомление об авторских правах, этот список условий и следующий отказ от ответственности.

source: Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
ru_ru: При вторичном распространении в двоичной форме должно воспроизводиться вышеприведённое уведомление об авторских правах, этот список условий и следующий отказ от ответственности в документации и/или других материалах, предоставляемых с распространяемым пакетом.

source: All advertising materials mentioning features or use of this software must display the following acknowledgment: "This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit. (http://www.openssl.org/)"
ru_ru: Все рекламные материалы, в которых говорится о функциях или использовании этого продукта, должны включать следующее уведомление: «Этот продукт включает программное обеспечение, разработанное организацией OpenSSL Project для использования в OpenSSL Toolkit. (http://www.openssl.org/)»

source: The names "OpenSSL Toolkit" and "OpenSSL Project" must not be used to endorse or promote products derived from this software without prior written permission. For written permission, please contact openssl-core@openssl.org.
ru_ru: Наименования «OpenSSL Toolkit» и «OpenSSL Project» не должны использоваться для рекомендации или продвижения продуктов, производных от данного программного продукта без предварительного письменного разрешения. За таким разрешением обращайтесь по адресу openssl-core@openssl.org.

source: Products derived from this software may not be called "OpenSSL" nor may "OpenSSL" appear in their names without prior written permission of the OpenSSL Project.
ru_ru: Продукты, производные от данного программного продукта, не могут называться «OpenSSL» не могут содержать «OpenSSL» в своём наименовании без предварительного письменного разрешения организации The OpenSSL Project.

source: Redistributions of any form whatsoever must retain the following acknowledgment: "This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit (http://www.openssl.org/)"
ru_ru: При вторичном распространении в любом виде должно сохраняться следующее уведомление: «Этот продукт включает программное обеспечение, разработанное организацией OpenSSL Project для использования в OpenSSL Toolkit (http://www.openssl.org/)»

source: THIS SOFTWARE IS PROVIDED BY THE OpenSSL PROJECT ''AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE OpenSSL PROJECT OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
ru_ru: НАСТОЯЩИЙ ПРОГРАММНЫЙ ПРОДУКТ ПРЕДОСТАВЛЯЕТСЯ ОРГАНИЗАЦИЕЙ THE OpenSSL PROJECT В ВИДЕ «КАК ЕСТЬ» И ПРИ ЭТОМ НЕ ДАЮТСЯ ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, В ЧАСТНОСТИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ КОММЕРЧЕСКОЙ ВЫГОДЫ ИЛИ ПРИГОДНОСТИ ДЛЯ КАКОЙ-ЛИБО ЦЕЛИ. ОРГАНИЗАЦИЯ THE OpenSSL PROJECT И УЧАСТНИКИ ЭТОГО ПРОЕКТА НИ В КОЕЙ МЕРЕ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА КАКИЕ-ЛИБО ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, УМЫШЛЕННЫЕ, ИСКЛЮЧИТЕЛЬНЫЕ ИЛИ ПОСЛЕДУЮЩИЕ УБЫТКИ (ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, ПРИОБРЕТЕНИЕ ВЗАИМОЗАМЕНЯЕМЫХ ТОВАРОВ ИЛИ УСЛУГ; ПОТЕРЮ ВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ПРЕРЫВАНИЕ ДЕЯТЕЛЬНОСТИ), ВОЗНИКШИЕ КАКИМ-ЛИБО ОБРАЗОМ И СОГЛАСНО КАКОМУ-ЛИБО ТОЛКОВАНИЮ ОТВЕТСТВЕННОСТИ, БУДЬ ТО КОНТРАКТНАЯ, БЕЗУСЛОВНАЯ ОТВЕТСТВЕННОСТЬ ИЛИ НАРУШЕНИЕ ЗАКОННЫХ ПРАВ (ВКЛЮЧАЯ ХАЛАТНОСТЬ ИЛИ ДРУГОЕ) В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ПРИ УКАЗАНИИ НА ВОЗМОЖНОСТЬ ТАКОГО УЩЕРБА.

source: This product includes cryptographic software written by Eric Young (`eay@cryptsoft.com <eay@cryptsoft.com>`_). This product includes software written by Tim Hudson (`tjh@cryptsoft.com <tjh@cryptsoft.com>`_).
ru_ru: Данный продукт включает криптографическое программное обеспечение, написанное Эриком Янгом (`eay@cryptsoft.com <eay@cryptsoft.com>`_). Данный продукт включает программное обеспечение, написанное Тимом Хадсоном (`tjh@cryptsoft.com <tjh@cryptsoft.com>`_).
