Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/options-miscellaneous.po
Languages: ru_ru

source: `pgAdmin Miscellaneous Options`:index:
ru_ru: `Разные параметры`:index:

source: Use the options that are located under the *Miscellaneous* node of the tree control to personalize the behavior of your workspace.
ru_ru: Воспользуйтесь элементами внутри узла *Разное* в этом дереве, чтобы настроить поведение окружения по своему вкусу.

source: Use the fields on the *User Interface* dialog to specify user interface preferences:
ru_ru: В разделе *Интерфейс* вы можете задать свои предпочтения для пользовательского интерфейса:

source: **User language** - Use the *User language* drop-down listbox to select the language displayed in the pgAdmin user interface.
ru_ru: **Язык пользователя** — В этом выпадающем списке вы можете выбрать язык для пользовательского интерфейса pgAdmin.

source: **System schemas** - pgAdmin will consider any schema (or schemas) listed in the *System schemas* field to be a system schema. To specify that a schema is a system schema, include the schema name in a list of comma-separated strings in the *System schemas* field.
ru_ru: **Системные схемы** — Все схемы, перечисленные в этом поле, pgAdmin будет считать системными. Чтобы указать, что схема является системной, добавьте её в это поле, а если схем несколько — разделите их список двоеточиями.

source: Use the fields on the *Help paths* dialog to specify the locations of help files. The path specified may be a URL or directory containing the HTML format help files (note that some browsers may require file:///path/to/local/files/ notation, while others require /path/to/local/files/ notation), or the path to a Compiled HTML Help (.chm) file (on Windows), an HTML Help project (.hhp) file, or a Zip archive containing the HTML files and the HTML Help project file.
ru_ru: Воспользуйтесь полями в разделе *Пути справки*, чтобы задать расположение файлов справки. В качестве пути может задаваться URL или путь к каталогу, содержащему файлы справки в формате HTML (заметьте, что для некоторых браузеров путь нужно задавать в виде file:///path/to/local/files/, а для других — в виде /path/to/local/files/), либо путь к файлу скомпилированной HTML-справки (.chm) (в Windows), путь к файлу проекта HTML-справки (.hhp) или путь к архиву Zip, содержащему файлы HTML и файл проекта HTML-справки.

source: **PG help path** - Use the *PG help path* field to specify the path to the PostgreSQL help files. PostgreSQL Help files are displayed when *PostgreSQL HELP* is selected from the *Help* menu, or when accessing the help files through many database objects on PostgreSQL servers.
ru_ru: **Путь к справке PG** — В этом поле указывается путь к файлам документации PostgreSQL. Документация PostgreSQL будет открываться при выборе пункта меню *Справка → Справка PostgreSQL* или при вызове справки для многих объектов баз данных на серверах PostgreSQL.

source: **EDB help path** - Use the *EDB help path* option to specify the path to the EnterpriseDB help files. EnterpriseDB Help files are displayed when *EnterpriseDB Help* is selected from the *Help* menu, or when accessing the help files through many database objects on EnterpriseDB servers.
ru_ru: **Путь к справке EDB** — В этом поле указывается путь к файлам документации EnterpriseDB. Документация EnterpriseDB будет открываться при выборе пункта меню *Справка → Справка EnterpriseDB* или при вызове справки для многих объектов баз данных на серверах PostgreSQL.

source: **GP help path** - Use the *GP help path* option to specify the path to the Greenplum help files. Greenplum Help files are displayed when *Greenplum Database Help* is selected from the *Help* menu, or when accessing the help files through many database objects on Greenplum servers.
ru_ru: **Путь к справке GP** — В этом поле указывается путь к файлам документации Greenplum. Документация Greenplum будет открываться при выборе пункта меню *Справка → Справка Greenplum* или при вызове справки для многих объектов баз данных на серверах Greenplum.

source: **Slony help path** - Use the *Slony help path* option to specify the path to the Slony help files. Slony Help files are displayed when *Slony Help* is selected from the *Help* menu.
ru_ru: **Путь к справке Slony** — В этом поле указывается путь к файлам документации Slony. Документация Slony будет открываться при выборе в меню *Справка → Справка Slony*.

source: By default, if pgAdmin suspects you might need support, it displays a guru hint window. Use the fields on the *Guru hints* dialog to suppress or display guru hints:
ru_ru: По умолчанию, если pgAdmin полагает, что вам может быть полезна помощь, он выводит окно с подсказкой гуру. В разделе *Подсказки гуру* вы можете управлять отображением/подавлением этих подсказок:

source: **Do not show guru hints; I'm one myself** - Check the box next to *Do not show guru hints; I'm one myself* to suppress this behaviour.
ru_ru: **Не показывать подсказки гуру — справлюсь самостоятельно** — Отметьте этот флажок, чтобы отключить это поведение.

source: **Reset guru hints** - Check the box next to *Reset guru hints* to instruct pgAdmin to display all guru hints until suppressed again.
ru_ru: **Сбросить подсказки гуру** — Отметьте этот флажок, чтобы pgAdmin снова выводил все подсказки гуру, которые могли быть подавлены.

source: Use the fields on the *Logging* dialog to specify the location and content of pgAdmin log files:
ru_ru: В разделе *Ведение журнала* вы можете настроить расположение и содержание файлов журналов pgAdmin:

source: **Logfile** - Select this option to specify the name of the file in which pgAdmin will store any logging data. If you include %ID in the specified file name, it will be replaced with the process ID, allowing multiple instances of pgAdmin to run with logging to individual files.
ru_ru: **Файл журнала** — В этом поле задаётся имя файла, в который pgAdmin будет выводить любую отладочную информацию. Если вы включите в имя файла %ID, этот спецкод будет заменён идентификатором процесса, что позволяет вести отдельные журналы для нескольких экземпляров pgAdmin.

source: **No logging** - No logging will be performed at all.
ru_ru: **Не вести журнал** — Журнал не будет вестись вовсе.

source: **Errors only** - pgAdmin will log errors to the log file, but nothing else.
ru_ru: **Только ошибки** — pgAdmin будет выводить в файл журнала только ошибки и ничего больше.

source: **Errors and Notices** - pgAdmin will log errors and notice messages from PostgreSQL to the log file, but nothing else.
ru_ru: **Ошибки и замечания** — pgAdmin будет выводить в журнал только ошибки и замечания от PostgreSQL.

source: **Errors, Notices, SQL** - Error messages, notice messages from PostgreSQL and SQL queries will be logged to the log file.
ru_ru: **Ошибки, замечания, SQL** — В файл журнала будут записываться сообщения об ошибках и замечания от PostgreSQL, а также SQL-запросы.

source: **Debug** - Error messages, notice messages from PostgreSQL, SQL queries and debug messages will be logged to the log file. This option may significantly slow down pgAdmin, and is therefore **not recommended for normal use**.
ru_ru: **Отладка** — В файл журнала будут записываться сообщения об ошибках и замечания от PostgreSQL, а также SQL-запросы и отладочные сообщения. Этот вариант может значительно замедлить работу pgAdmin и поэтому он **не рекомендуется для обычного использования**.
