Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/options-query_tool.po
Languages: ru_ru

source: `pgAdmin Query tool Options`:index:
ru_ru: `Параметры запросника pgAdmin`:index:

source: Use the options that are located under the *Query tool* node of the tree control to personalize the behavior of the Query tool.
ru_ru: Воспользуйтесь элементами внутри узла *Запросник* в этом дереве, чтобы настроить по своему вкусу поведение запросника.

source: Use the fields on the *Query editor* dialog to specify workspace preferences for the Query editor:
ru_ru: В разделе *Редактор* вы можете задать свои предпочтения для редактора запросов:

source: **Font** - Use the *Font* selector to specify the font used in the Query tool interface.
ru_ru: **Шрифт** — Определите в этом элементе выбора шрифт, который будет использоваться в интерфейсе запросника.

source: **Max characters per column** - Use the *Max characters per column* field to specify the maximum length of data displayed in a single column.
ru_ru: **Максимальное число символов в столбце** — Задайте в этом столбце максимальную длину текста, отображаемого в одном столбце.

source: **Indent characters** - Use the *Indent* characters field to specify the number of characters to indent with in SQL text boxes.
ru_ru: **Символов отступа** — Задайте в этом поле, на сколько символов должен отодвигаться текст с отступом в полях ввода SQL.

source: **Use spaces instead of tabs** - Check the box next to *Use spaces instead of tabs* to instruct pgAdmin to insert a space when you press the tab key in an SQL text box.
ru_ru: **Использовать пробелы вместо табуляции** — Отметьте этот флажок, чтобы pgAdmin вставлял пробелы, когда вы нажимаете клавишу Tab в редакторе SQL.

source: **Copy SQL from main window to SQL dialogue** - Check the box next to *Copy SQL from main window to SQL dialogue* to instruct pgAdmin to copy any object definition displayed on the main object browser for use as a default query in the Query Tool when the Query Tool opens.
ru_ru: **Копировать SQL из основного окна в запросник** — Отметьте этот флажок, чтобы pgAdmin копировал определение любого объекта, выбранного в основном дереве обзора, как исходный запрос в запросник, когда вы его открываете.

source: **Enable Auto ROLLBACK** - Check the box next to *Enable Auto ROLLBACK* to instruct the query tool to execute a ROLLBACK if a query fails.
ru_ru: **Включить автооткат** — Отметьте этот флажок, чтобы запросник выполнял ROLLBACK в случае ошибки при выполнении запроса.

source: **Enable Auto COMMIT** - Check the box next to *Enable Auto COMMIT* to instruct the query tool to enable auto commit after executing the query.
ru_ru: **Включить автофиксацию** — Отметьте этот флажок, чтобы запросник выполнял COMMIT после завершения запроса.

source: **Keywords in uppercase** - Check the box next to *Keywords in uppercase* to instruct the Query tool to convert any keywords entered to an uppercase font.
ru_ru: **Ключевые слова в верхнем регистре** — Отметьте этот флажок, чтобы запросник отображал вводимые ключевые слова шрифтом с символами в верхнем регистре.

source: **External formatting utility** - Use the *External formatting utility* field to provide the name of a formatting tool that can be used to make queries more readable. Use of a tool that provides support for UTF-8 multi-byte characters is not required, but is preferable. The utility must:
ru_ru: **Внешняя утилита форматирования** — В этом поле вы можете задать имя утилиты форматирования, которая может сделать запрос более читаемым. Рекомендуется выбирать утилиту, которая поддерживает многобайтовые символы UTF-8, хотя это не строгое требование. Эта утилита должна:

source: Accept a STDIN stream and write the result set to STDOUT
ru_ru: Принимать текст из потока STDIN и записывать результат в STDOUT

source: Provide a result in less than 3 seconds
ru_ru: Выдавать результат не дольше чем 3 секунды

source: Exit with a code 0 on success
ru_ru: Возвращать код выхода 0 в случае успеха

source: To use an external formatting tool in the Query Editor:
ru_ru: Для использования внешней утилиты форматирования в запроснике:

source: Provide the name of the formatting tool in the *External formatting utility* field of the *Options* dialogue.
ru_ru: Задайте имя этой утилиты в поле *Внешняя утилита форматирования* в диалоге *Параметры*.

source: In the Query Editor, select a block of text for formatting, and Press Ctrl+Shift+f, or navigate through the *Edit* menu to the *Format* menu, and select *External Format*.
ru_ru: В запроснике выделите блок текста для форматирования и нажмите клавиши Ctrl+Shift+F либо выберите в меню *Правка → Формат → Внешнее форматирование*.

source: Use the fields displayed on the *Colours* dialog to select colours for items displayed in the Query tool:
ru_ru: В разделе *Цвета* вы можете определить цвета элементов, отображаемых в запроснике:

source: **Foreground/Background** - Use the color selectors in the **Foreground/Background** box to specify background and foreground colors for the Query tool.
ru_ru: **Текст/фон** — Воспользуйтесь элементами выбора цвета в группе **Текст/фон**, чтобы задать цвета текста и фона в запроснике.

source: **Caret** - Use the color selector in the **Caret** box to specify a color for the caret (or cursor).
ru_ru: **Курсор** — Воспользуйтесь этим элементом выбора цвета, чтобы задать цвет курсора.

source: **SQL Syntax Highlighting** - Use the color selectors in the **SQL Syntax Highlighting** box to specify display colors for syntax components.
ru_ru: **Подсветка синтаксиса SQL-запросов** — Воспользуйтесь элементами выбора цвета в этой группе, чтобы задать цвета для разных компонентов синтаксиса.

source: Use the fields on the *Results Grid* dialog to specify display preferences for the results grid.
ru_ru: В разделе *Результаты* вы можете задать свои предпочтения для таблицы результатов.

source: **Result copy quoting** - Use the *Result copy quoting* drop-down listbox to specify how fields in a result set should be quoted when copied to the clipboard from the result list. **Please Note** Disabling this option may prevent copying and pasting rows in the edit grid from functioning properly if the result set contains special characters like line breaks. Specify:
ru_ru: **Заключение копируемого результата в кавычки** — Воспользуйтесь этим выпадающим списком, чтобы определить, как должны заключаться в кавычки поля набора результатов при копировании их в буфер обмена. **Обратите внимание:** Если заключение результата в кавычки полностью отключить, копирование и вставка строк в таблице может перестать работать корректно, если в наборе результатов окажутся спецсимволы, например, переводы строк. Укажите:

source: *None* to omit quotes when copied.
ru_ru: *Нет*: чтобы кавычки при копировании не добавлялись.

source: *Strings* to quote string values when copied (numeric columns will not be quoted).
ru_ru: *Строки*: чтобы при копировании в кавычки заключались текстовые строки (числовые столбцы заключаться в кавычки не будут).

source: *All* to quote all copied values (regardless of data type).
ru_ru: *Все*: чтобы в кавычки заключались все копируемые значения (независимо от типа данных).

source: **Result copy quote character** - Use the *Result copy quote character* drop-down listbox to select a character that will be used to quote the values when copied to the clipboard from the result list. It has no effect if *Result copy quoting* is set to *None*.
ru_ru: **При копировании заключать результат в** — Воспользуйтесь этим выпадающим списком, чтобы выбрать символ на роль кавычек при копировании значений в буфер обмена из набора результатов. Этот выбор не действует, если в списке *Заключение копируемого результата в кавычки* выбран вариант *Нет*.

source: **Result copy field separator** - Use the *Result copy field separator* drop-down listbox to select a character that will be used to separate the fields copied to the clipboard from the result list.
ru_ru: **Разделитель полей при копировании результата** — Воспользуйтесь этим выпадающим списком, чтобы выбрать символ, который будет разделять поля, копируемые в буфер обмена из набора результатов.

source: **Show NULL values as <NULL>** - Check the box next to *Show NULL values as <NULL>* to cause NULL values to be shown as <NULL> in the Query Tool's results grid. Note that this option does not affect data that is exported from the grid, only what is displayed.
ru_ru: **Показывать NULL-значения как <NULL>** — Отметьте этот флажок, чтобы значения NULL выводились в таблице результатов в запроснике как <NULL>. Заметьте, что это не меняет представление данных, экспортируемых из таблицы, а влияет только на отображение.

source: **Thousands separator** - Use the *Thousands separator* field to specify a delimiter character that will be used to break a value into groups of three digits, counting left from the decimal mark.
ru_ru: **Разделитель разрядов** — Воспользуйтесь этим полем, чтобы задать символ, который будет разделять числа на группы по три цифры, отсчитывая влево от десятичной точки.

source: **Decimal mark** - Use the *Decimal mark* field to specify a delimiter character that will be used to break a number into an integer portion and a fractional portion.
ru_ru: **Разделитель дробной части** — Воспользуйтесь этим полем, чтобы задать символ, который будет отделять целую часть числа от дробной.

source: **Copy column names** - Check the box next to *Copy column names* to specify that when copying from the result grid, the column name should be included as the first row.
ru_ru: **Копировать имена столбцов** — Отметьте этот флажок, чтобы при копировании данных из таблицы результатов в качестве первой строки добавлялась строка с именами столбцов.

source: Use the fields on the *Query File* dialog to specify UTF-8 details, and file saving preferences:
ru_ru: В разделе *Файлы запросов* вы можете задать параметры UTF-8 и предпочтения относительно сохранения файлов:

source: **Read and write Unicode UTF-8 files** - Check the box next to *Read and write Unicode UTF-8 files* to write Unicode UTF-8 files by default.
ru_ru: **Читать и записывать файлы в формате UTF-8** — Отметьте этот флажок, чтобы файлы по умолчанию записывались в UTF-8.

source: **Write BOM for UTF files** - Check the box next to *Write BOM for UTF files* to instruct the query tool to write a *byte order mark* at the beginning of each file written.
ru_ru: **Записывать BOM в UTF-файлы** — Отметьте этот флажок, чтобы запросник добавлял в начало каждого записываемого файла *метку порядка байт* (Byte Order Mark, BOM).

source: **Do not prompt for unsaved files on exit** - Check the box next to *Do not prompt for unsaved files on exit* to prevent pgAdmin from prompting you to save SQL queries upon exit.
ru_ru: **Не спрашивать о несохранённых файлах при выходе** — Отметьте этот флажок, чтобы pgAdmin при выходе не спрашивал, нужно ли сохранять SQL-запросы.

source: Use the fields on the *Favourites* dialog to specify a location for the Query tool's *Favourites* file:
ru_ru: В разделе *Избранное* вы можете задать расположение файла с *Избранным* содержимым:

source: **Favourites file path** - The *Favourites file path* field specifies the path to the Query tool's *Favourites* file. The default file name is *pgadmin_favourites.xml*; you can use the *Browse* button to open a file browser and modify the location of the file.
ru_ru: **Путь к файлу Избранное** — В этом поле задаётся путь, в котором сохраняется *Избранное* содержимое запросника. По умолчанию имя этого файла — *pgadmin_favourites.xml*; воспользовавшись кнопкой *Обзор*, можно открыть обозреватель файлов и выбрать другой путь/файл.

source: Use the fields on the *Macros* dialog to specify a location for the Query tool's *Macros* file:
ru_ru: В разделе *Макросы* вы можете задать расположение файла с *макросами*:

source: **Macros file path** - The *Macros file path* field specifies the path to the Query tool's *Macros* file. The default file name is *pgadmin_macros.xml*; you can use the *Browse* button to open a file browser and modify the location of the file.
ru_ru: **Путь к файлу макросов** — В этом поле задаётся путь, в котором сохраняются макросы запросника. По умолчанию имя этого файла — *pgadmin_macros.xml*; воспользовавшись кнопкой *Обзор*, можно открыть обозреватель файлов и выбрать другой путь/файл.

source: Use the fields on the *History File* dialog to specify user preferences for the Query tool's history file:
ru_ru: В разделе *Файл истории* вы можете задать свои предпочтения для ведения файла истории:

source: **History file path** - The *History file path* specifies the path to the Query tool's history file. The default file name is *pgadmin_histoqueries.xml*; you can use the *Browse* button to open a file browser and modify the location of the file.
ru_ru: **Путь к файлу истории** — В этом поле задаётся путь, в котором сохраняется история запросов. По умолчанию имя этого файла — *pgadmin_histoqueries.xml*; воспользовавшись кнопкой *Обзор*, можно открыть обозреватель файлов и выбрать другой путь/файл.

source: **Maximum queries to store in history** - Use the *Maximum queries to store in history* field to specify the number of queries stored by pgAdmin. When the maximum number of queries is reached, the oldest query will be deleted, and a new query will be stored.
ru_ru: **Максимальное количество запросов, сохраняемых в истории** — Воспользуйтесь этим полем, чтобы задать, сколько запросов должен сохранять pgAdmin. Когда достигается это число запросов, самый старый запрос удаляется, а затем сохраняется новый запрос.

source: **Maximum size of a stored query (in bytes)** - Use the *Maximum size of a stored query (in bytes)* field to specify the size (in bytes) of the largest query that will be stored in the history file; any query that exceeds the specified size will not be saved in the history file.
ru_ru: **Максимальный размер сохранённого запроса (в байтах)** — Воспользуйтесь этим полем, чтобы задать размер самого большого запроса, который может быть сохранён в файле истории; запросы большего размера в этом файле сохраняться не будут.
