Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/options-browser.po
Languages: ru_ru

source: `pgAdmin Browser Options`:index:
ru_ru: `Параметры обозревателя`:index:

source: Use the options that are located under the *Browser* node of the tree control to personalize your workspace.
ru_ru: Воспользуйтесь элементами внутри узла *Обозреватель* в этом дереве, чтобы настроить рабочую среду по своему вкусу.

source: Use the options on the *Display* dialog to specify general display preferences:
ru_ru: В разделе *Отображение* вы можете задать общие предпочтения:

source: **Display the following database objects** - Check the box next to a database object type to instruct pgAdmin to display the selected object type in the pgAdmin tree control. By default, pgAdmin displays only the most commonly used object types.
ru_ru: **Показывать следующие объекты базы данных** — Отметьте флажок рядом с типом объектов, чтобы pgAdmin показывал объекты данного типа в дереве обзора. По умолчанию pgAdmin показывает только наиболее часто используемые типы объектов.

source: **Default** - You can reduce the number of object types displayed to increase the speed of pgAdmin when querying the system catalogs. Use the *Default* button to reset the list to its default settings.
ru_ru: **По умолчанию** — Число отображаемых типов объектов можно сократить, чтобы увеличить быстродействие pgAdmin, оптимизируя обращения к системным каталогам. Если вы захотите сбросить список к начальному состоянию, нажмите кнопку *По умолчанию*.

source: Use the options on the *Properties* dialog to specify display properties:
ru_ru: Перейдите в раздел *Свойства*, чтобы задать параметры отображения:

source: **Count rows if estimated less than** - Include a value in the *Count rows if estimated less than* field to perform a SELECT count(*) if the estimated number of rows in a table (as read from the table statistics) is below the specified limit. After performing the SELECT count(*), pgAdmin will display the row count.
ru_ru: **Подсчитывать строки, если их примерное количество меньше** — Задайте значение в этом поле, чтобы pgAdmin выполнял SELECT count(*), если примерное количество строк в таблице (исходя из статистики таблицы) меньше заданного числа. Выполнив SELECT count(*), pgAdmin выведет точное количество строк.

source: Use the options on the *Binary paths* dialog to specify binary file locations:
ru_ru: Перейдите в раздел *Пути программ*, чтобы задать пути к программам, которые может использовать pgAdmin:

source: **Slony-I path** - To enable pgAdmin to create Slony-I replication clusters from scratch, you must provide the path to the Slony-I script installation directory in this field. If no valid scripts can be found, you will only be allowed to join existing clusters.
ru_ru: **Путь к Slony-I** — Чтобы pgAdmin мог сам создавать кластеры репликации Slony-I, вам необходимо задать в этом поле путь к каталогу скриптов Slony-I. Если pgAdmin не находит подходящие скрипты, вы сможете только подключаться к существующим кластерам.

source: **PG bin path** - Use this field to specify the path to the standard PostgreSQL pg_dump, pg_restore and pg_dumpall utilities. pgAdmin will use these utilities when backing up and restoring your PostgreSQL databases. If this path is not set, pgAdmin will attempt to locate the utilities in its installation directory, the 'hint' directory set by a local PostgreSQL installation (on Windows) and in the system path.
ru_ru: **Путь к программам PG** — Задайте в этом поле путь к каталогу со стандартными утилитами PostgreSQL pg_dump, pg_restore и pg_dumpall. pgAdmin будет обращаться к ним для выполнения резервного копирования и восстановления баз данных PostgreSQL. Если этот путь не задан, pgAdmin попытается найти эти программы в своём каталоге инсталляции, каталоге, «подсказанном» инсталлятором PostgreSQL (в Windows), и в системном пути.

source: **EDB bin path** - Use this field to specify the path to the EnterpriseDB pg_dump, pg_restore and pg_dumpall utilities. pgAdmin will use these utilities when backing up and restoring your EnterpriseDB databases. If this path is not set, pgAdmin will attempt to find the utilities in standard locations used by EnterpriseDB.
ru_ru: **Путь к программам EDB** — задайте в этом поле путь к каталогу с утилитами EnterpriseDB pg_dump, pg_restore и pg_dumpall. pgAdmin будет обращаться к ним для выполнения резервного копирования и восстановления баз данных EnterpriseDB. Если этот путь не задан, pgAdmin попытается найти эти утилиты в расположении, принятом для EnterpriseDB.

source: **GP bin path** - Use this field to specify the path to the Greenplum pg_dump, pg_restore and pg_dumpall utilities. pgAdmin will use these utilities when backing up and restoring your Greenplum databases. If this path is not set, pgAdmin will attempt to find the utilities in standard locations used by Greenplum.
ru_ru: **Путь к программам GP** — задайте в этом поле путь к каталогу с утилитами Greenplum pg_dump, pg_restore и pg_dumpall. pgAdmin будет обращаться к ним для выполнения резервного копирования и восстановления баз данных Greenplum. Если этот путь не задан, pgAdmin попытается найти эти утилиты в расположении, принятом для Greenplum.

source: Use the options on the *UI Miscellaneous* dialog to specify miscellaneous pgAdmin preferences:
ru_ru: В разделе *Прочее* вы можете настроить различные аспекты поведения и внешнего вида pgAdmin:

source: **Font** - Use the *Font* selector to specify the font used as the standard font throughout pgAdmin's main user interface. This may be useful for countries with multibyte character sets (where standard fonts may not display well), or if you wish to use a font different from the one configured on your system.
ru_ru: **Шрифт** — Воспользуйтесь элементом выбора шрифта, чтобы задать шрифт, который станет стандартным в основном интерфейсе пользователя pgAdmin. Это может быть полезно в языковой среде с многобайтными наборами символов (где обычные шрифты могут отображаться неудовлетворительно) или если вы хотите использовать шрифт, отличный от выбранного в системе по умолчанию.

source: **Confirm object deletion** - Select this option to instruct pgAdmin to require confirmation before deleting an object (recommended).
ru_ru: **Подтверждать удаление объекта** — Отметьте этот флажок, чтобы pgAdmin запрашивал подтверждение перед удалением объектов (рекомендуется).

source: **Show System Objects in the treeview** - Check the box next to *Show System Objects in the treeview* to instruct pgAdmin to display objects such as system schemas (e.g. pg_temp*) and system columns (e.g. xmin, ctid) in the tree control.
ru_ru: **Показывать системные объекты в дереве объектов** — Отметьте этот флажок, чтобы pgAdmin отображал в дереве обозревателя такие объекты, как системные схемы (например, pg_temp*) и системные столбцы (например, xmin, ctid).

source: **Show users for privileges** - Select this option to include usernames as well as groups in the subject list when viewing the *Privileges* tab of an object that supports privileges. Disabling this option is useful on large systems with many users that are organised in groups.
ru_ru: **Показывать пользователей по правам** — Отметьте этот флажок, чтобы в списке субъектов, показываемом на вкладке *Права* для объектов, которые поддерживают назначение прав доступа, выводились имена пользователей и групп. Отключать это может быть полезно в больших системах, где имеется множество пользователей, распределённых по группам.

source: **Show object properties on double click in treeview** - Select this option to specify that double clicking an object in the treeview should open the *Properties* dialogue for that object. Disable this option to browse the treeview using a double-click.
ru_ru: **Показывать свойства объекта по двойному щелчку** — Отметьте этот флажок, чтобы при двойном щелчке по объекту в дереве обозревателя открывался диалог *Свойств* для этого объекта. Снимите его, чтобы по двойному щелчку происходило разворачивание объекта в дереве.

source: **Show NOTICEs** - Check the box next to *Show NOTICEs to* instruct pgAdmin to display notices from the server.
ru_ru: **Показывать уведомления (NOTICE)** — Отметьте этот флажок, чтобы pgAdmin отображал уведомления, поступающие с сервера.

source: **Refresh on click** - Use the *Refresh on click* drop-down listbox to specify that the displayed properties of the selected objects should be updated in the tree control when the object is selected. Select from:
ru_ru: **Обновлять по щелчку** — Выберите в этом выпадающем списке вариант обновления свойств определённых объектов в дереве при выделении некоторого объекта. Возможны следующие варианты:

source: *None* to update no objects.
ru_ru: *Нет* — не обновлять никакие объекты.

source: *Refresh object on click* to refresh the selected object.
ru_ru: *Обновлять объект по щелчку* — обновить свойства только выделенного объекта.

source: *Refresh object and children on click* to refresh the selected object, and any objects that reside under the selected object in the tree control.
ru_ru: *Обновлять объект и его потомки по щелчку* — чтобы обновить выделенный объект, а также все объекты, вложенные в него в дереве.
