Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/password.po
Languages: ru_ru

source: `Change Password`:index:
ru_ru: `Смена пароля`:index:

source: To change your password, follow the following steps:
ru_ru: Чтобы сменить свой пароль, выполните следующие действия:

source: Enter your current password in the *Current Password* textbox.
ru_ru: Введите действующий пароль в поле *Текущий пароль*.

source: Enter your desired password in the *New Password* textbox.
ru_ru: Введите пароль, который вы хотите установить, в поле *Новый пароль*.

source: Enter your desired password again, this time in the *Confirm Password* textbox.
ru_ru: Введите устанавливаемый пароль ещё раз, на этот раз в поле *Подтверждение*.

source: Click the *OK* button.
ru_ru: Нажмите кнопку *ОК*.

source: Good practice
ru_ru: Рекомендации

source: It is good policy to set a password to protect your data, even in 'safe' environments such as at home. In the workplace, failure to apply an appropriate password policy could leave you in breach of Data Protection laws in some circumstances.
ru_ru: Хорошей политикой считается задавать пароль для защиты данных, даже в «безопасном» окружении, например, дома. В рабочей же среде отсутствие должной парольной защиты может даже расцениваться как нарушение соответствующих законов, связанных с защитой данных.

source: pgAdmin does not enforce any password restrictions, however we do recommend that you consider the following guidelines when selecting passwords. This is not an exhaustive list and **will not guarantee security**.
ru_ru: pgAdmin не вводит никаких ограничений для паролей, однако мы рекомендуем вам следовать советам по выбору паролей. Это далеко не исчерпывающий список рекомендаций и он **не гарантирует полную безопасность**.

source: Ensure that passwords are of adequate length. 6 characters should be the absolute minimum.
ru_ru: Выбирайте пароли достаточной длины (абсолютный минимум — 6 символов).

source: Ensure that passwords are not easily guessable by others, or open to dictionary attacks. Use a mixture of upper and lower case letters and numerics, and avoid using words or names. Consider using the first letter from each word in a phrase that you will remember easily but others will not guess.
ru_ru: Выбирайте пароли, которые не смогут легко угадать другие люди и устойчивы к перебору по словарю. Используйте смесь букв в верхнем и нижнем регистре, а также цифры, и избегайте использования слов или имён. Один из вариантов — взять по одной букве из фразы, которую вы легко вспомните, но не смогут угадать другие.

source: Ensure that your password is change regularly - at least every ninety days.
ru_ru: Обязательно регулярно меняйте ваш пароль — как минимум каждые три месяца.
