Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/pgagent-install.po
Languages: ru_ru

source: `pgAgent Installation`:index:
ru_ru: `Установка pgAgent`:index:

source: pgAgent runs as a daemon on Unix systems, and a service on Windows systems. In the majority of cases it will run on the database server itself - it is for this reason that pgAgent is not automatically setup when pgAdmin is installed. In some cases however, it may be preferable to run pgAgent on multiple systems, against the same database - individual jobs may be targetted at a particular host, or left for execution by any host. Locking prevents execution of the same instance of a job by multiple hosts.
ru_ru: pgAgent работает в системах Unix в виде демона, а в Windows — в виде службы. В большинстве случаев он будет работать на самом сервере баз данных — поэтому pgAgent не устанавливается автоматически при установке pgAdmin. Однако в некоторых случаях может быть уместно запустить pgAgent в нескольких системах и нацелить на одну базу данных — отдельные задания могут назначаться определённому узлу либо оставаться свободными для выполнения на любом узле. Чтобы одно задание не выполнялось одновременно несколькими узлами, применяется блокировка.

source: Database setup
ru_ru: Настройка базы данных

source: pgAgent stores its configuration in the 'postgres' database in your cluster. This database exists by default in PostgreSQL 8.1 versions, for earlier versions you need to create the database yourself. The database must have the pl/pgsql procedural language installed - PostgreSQL's 'createlang' program can do this if required.
ru_ru: pgAgent хранит свою конфигурацию в кластере в базе данных postgres. Эта база данных существует по умолчанию в PostgreSQL 8.1 и новее, а для более старых версий вы должны создать её сами. В этой базе данных должен быть установлен процедурный язык pl/pgsql — установить его можно с помощью программы PostgreSQL createlang, если потребуется.

source: Connect to the "postgres" database (once created if needed), and open the SQL tool. If the server is 9.1 or later, and pgAgent 3.4.0 or later, simply paste in this query and click the 'Run' button:
ru_ru: Подключитесь к базе данных postgres (предварительно создав её, если нужно) и откройте консоль SQL. Если версия сервера — 9.1 или новее и версия pgAgent — 3.4.0 или новее, просто вставьте в редактор SQL этот запрос и нажмите кнопку *Выполнить*:

source: This command will create a number of tables and other objects in a schema called 'pgagent'.
ru_ru: Эта команда создаст набор таблиц и другие объекты в схеме pgagent.

source: For earlier versions of PostgreSQL or pgAgent, select the File -> Open option from the menu and find the 'pgagent.sql' script installed with pgAdmin. The installation location for this file varies from operating system to operating system, however it will normally be found under 'C:\Program files\pgAdmin III' on Windows systems (or 'C:\Program files\PostgreSQL\8.x\pgAdmin III' if installed with the PostgreSQL server installer), or '/usr/local/pgadmin3/share/pgadmin3' or '/usr/share/pgadmin3' on Unix systems. Once the file is loaded, click the 'Run' button to execute the script.
ru_ru: Для более ранних версий PostgreSQL или pgAgent выберите в меню *Файл → Открыть* и найдите скрипт pgagent.sql, установленный вместе с pgAdmin. Расположение этого файла в разных операционных системах может быть разным, однако обычно он находится в "C:\\Program files\\pgAdmin III" в системах Windows (или в "C:\\Program files\\PostgreSQL\\8.x\\pgAdmin III", если он был установлен с установщиком сервера PostgreSQL) или в '/usr/local/pgadmin3/share/pgadmin3' либо '/usr/share/pgadmin3' в системах Unix. Загрузив этот файл, нажмите кнопку *Выполнить*, чтобы выполнить скрипт.

source: The script will create a number of tables and other objects in a schema called 'pgagent'.
ru_ru: Этот скрипт создаст набор таблиц и другие объекты в схеме pgagent.

source: Daemon installation on Unix
ru_ru: Установка демона в Unix

source: To install the pgAgent daemon on a Unix system, you will normally need to have root privileges to modify the system startup scripts - doing so is quite system specific so you should consult your system documentation for further information.
ru_ru: Чтобы установить демон pgAgent в системе Unix, обычно вам нужно иметь права root для изменения скриптов запуска системы — в разных системах демон устанавливается по-разному, поэтому за дальнейшими инструкциями следует обратиться к документации системы.

source: The program itself takes few command line options - most of which are only needed for debugging or specialised configurations::
ru_ru: Сама программа принимает несколько параметров командной строки — большинство из них требуются только для отладки или особых конфигураций::

source: Usage: /path/to/pgagent [options] <connect-string> options: -f run in the foreground (do not detach from the terminal) -t <poll time interval in seconds (default 10)> -r <retry period after connection abort in seconds (>=10, default 30)> -s <log file (messages are logged to STDOUT if not specified)> -l <logging verbosity (ERROR=0, WARNING=1, DEBUG=2, default 0)>
ru_ru: Использование: /путь/к/pgagent [параметры] <строка-подключения> параметры: -f работать на переднем плане (не отключаться от терминала) -t <интервал опроса в секундах (по умолчанию 10)> -r <период повторного обращения после разрыва соединения в секундах (>=10, по умолчанию 30)> -s <файл журнала (если не указано, сообщения выводятся в STDOUT)> -l <уровень важности сообщений (ERROR=0, WARNING=1, DEBUG=2, по умолчанию — 0)>

source: The connect string required is a standard PostgreSQL libpq connection string (see the `PostgreSQL documentation on the connection string <http://www.postgresql.org/docs/current/static/libpq.html#libpq-connect>`_ for further details). For example, the following command lilne will run pgAgent against a server listening on the localhost, using a database called 'pgadmin', connecting as the user 'postgres'::
ru_ru: Требуемая строка подключения должна задаваться в виде стандартной строки подключения PostgreSQL (за дополнительными сведениями обратитесь к `описанию строк подключения в документации PostgreSQL <https://postgrespro.ru/docs/postgresql/current/libpq-connect.html#libpq-connstring>`_). Например, следующая командная строка запустит pgAgent для подключения к серверу, работающему локально, базе данных pgadmin, под именем пользователя postgres::

source: /path/to/pgagent hostaddr=127.0.0.1 dbname=postgres user=postgres
ru_ru: /путь/к/pgagent hostaddr=127.0.0.1 dbname=postgres user=postgres

source: Service installation on Windows
ru_ru: Установка службы в Windows

source: pgAgent is able to self-install itself as a service on Windows systems. The command line options available are similar to those on Unix systems, but include an additional parameter to tell the service what to do::
ru_ru: В системах Windows pgAgent может сам устанавливаться в виде службы. Параметры командной строки подобны тем, что принимаются в системах Unix, но есть и ещё один, дополнительный, указывающий, что делать службе::

source: Usage: pgAgent REMOVE <serviceName> pgAgent INSTALL <serviceName> [options] <connect-string> pgAgent DEBUG [options] <connect-string> options: -u <user or DOMAIN\user> -p <password> -d <displayname> -t <poll time interval in seconds (default 10)> -r <retry period after connection abort in seconds (>=10, default 30)> -l <logging verbosity (ERROR=0, WARNING=1, DEBUG=2, default 0)>
ru_ru: Использование: pgAgent REMOVE <имя-службы> pgAgent INSTALL <имя-службы> [параметры] <строка-подключения> pgAgent DEBUG [options] <строка-подключения> параметры: -u <пользователь или ДОМЕН\пользователь> -p <пароль> -d <отображаемое-имя> -t <интервал опроса в секундах (по умолчанию 10)> -r <период повторного обращения после разрыва соединения в секундах (>=10, по умолчанию 30)> -l <уровень важности сообщений (ERROR=0, WARNING=1, DEBUG=2, по умолчанию — 0)>

source: The service may be quite simply installed from the command line as follows (adjusting the path as required)::
ru_ru: Службу можно довольно просто установить в командной строке следующим образом (откорректируйте путь, если требуется)::

source: The service may then be started from the command line using *net start pgAgent*, or from the *Services* control panel applet. Any logging output or errors will be reported in the Application event log. The DEBUG mode may be used to run pgAgent from a command prompt. When run this way, log messages will output to the command window.
ru_ru: Затем службу можно запустить из командной строки, выполнив *net start pgAgent*, либо из компонента панели управления *Службы*. Все выводимые службой сообщения или ошибки будут попадать в журнал событий *Приложения*. Также для запуска pgAgent из командной строки можно использовать режим DEBUG. При запуске в этом режиме сообщения будут выводиться в окно командной оболочки.

source: Security concerns
ru_ru: Вопросы безопасности

source: pgAgent is a very powerful tool, but does have some security considerations that you should be aware of:
ru_ru: pgAgent — это очень мощный инструмент, но, используя его, необходимо иметь в виду следующие аспекты безопасности:

source: **Database password** - *DO NOT* be tempted to include a password in the pgAgent connection string - on Unix systems it may be visible to all users in 'ps' output, and on Windows systems it will be stored in the registry in plain text. Instead, use a libpq *~/.pgpass* file to store the passwords for every database that pgAgent must access. Details of this technique may be found in the `PostgreSQL documentation on .pgpass file <http://www.postgresql.org/docs/current/static/libpq-pgpass.html>`_.
ru_ru: **Пароль базы данных** — *Не* поддавайтесь соблазну указать пароль в строке подключения pgAgent — в системах Unix он может быть виден всем пользователям в выводе команды 'ps', а в системах Windows он будет храниться в реестре открытым текстом. Вместо этого, сохраните пароли для каждой базы данных, к которой должен обращаться pgAgent, в файле *~/.pgpass*, поддерживаемом libpq. Подробнее об этом приёме можно узнать в `описании файла .pgpass в документации PostgreSQL <https://postgrespro.ru/docs/postgresql/current/libpq-pgpass.html>`_.

source: **System/database access** - all jobs run by pgAgent will run with the security privileges of the pgAgent user. SQL steps will run as the user that pgAgent connects to the database as, and batch/shell scripts will run as the operating system user that the pgAgent service or daemon is running under. Because of this, it is essential to maintain control over the users that are able to create and modify jobs. By default, only the user that created the pgAgent database objects will be able to do this - this will normally be the PostgreSQL superuser.
ru_ru: **Доступ к базе данных/системе** — все задания, которые запускает pgAgent, будут исполняться с правами доступа пользователя pgAgent. Шаги на SQL будут исполняться с правами пользователя, под именем которого pgAgent подключается к базе данных, а скрипты оболочки — с правами пользователя операционной системы, под именем которого работает демон или служба pgAgent. Поэтому важно контролировать пользователей, которые могут создавать или изменять задания. По умолчанию это разрешено только пользователю, создавшему объекты базы данных для pgAgent — обычно это суперпользователь PostgreSQL.
