Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/pgscript.po
Languages: ru

source: *sequence* means that a sequence of values is generated in a random order, in other words each value appears only once before the sequence starts again: this is useful for columns with a ``UNIQUE`` constraint. For example, this generator::
ru: Режим *последовательность* означает, что в случайном порядке генерируется последовательность всех значений, то есть каждое значение выдаётся только один раз, прежде чем последовательность начинает повторяться: это полезно для столбцов с ограничением ``UNIQUE``. Например, этот генератор::

source: SET @G = INTEGER(10, 15, 1); -- 1 means generate a sequence
ru: SET @G = INTEGER(10, 15, 1); -- 1 — означает, что будет формироваться последовательность

source: It can generate such values::
ru: может генерировать такие значения::

source: Where each number appears once before the sequence starts repeating.
ru: В которой каждой число выдаётся один раз, прежде чем последовательность начинает повторяться.

source: *sequence* parameter must be an integer: if it is 0 then no sequence is generated (default) and if something other than 0 then generate a sequence.
ru: В параметре *последовательность* должно передаваться целое число: если это 0, последовательность не генерируется (это вариант по умолчанию), а генерируется при любом другом числе.

source: *seed* is an integer value for initializing a generator: two generators with the same parameters and the same seed will generate **exactly** the same values.
ru: В параметре *затравка* задаётся целое число для инициализации генератора: два генератора с одинаковыми параметрами и одной затравкой будут выдавать **абсолютно** одинаковые значения.

source: *seed* must be an integer: it is used directly to initialize the random data generator.
ru: *Затравка* должна быть целым числом: она используется непосредственно для инициализации генератора случайных чисел.

source: Optional parameters are put into brackets::
ru: Необязательные параметры заключены в фигурные скобки::

source: Generator : INTEGER ( min, max, [sequence], [seed] ); | REAL ( min, max, precision, [sequence], [seed] ); | DATE ( min, max, [sequence], [seed] ); | TIME ( min, max, [sequence], [seed] ); | DATETIME ( min, max, [sequence], [seed] ); | STRING ( min, max, [nb], [seed] ); | REGEX ( regex, [seed] ); | FILE ( path, [sequence], [seed], [encoding] ); | REFERENCE ( table, column, [sequence], [seed] );
ru: Генератор: INTEGER ( мин, макс, [последовательность], [затравка] ); | REAL ( мин, макс, точность, [последовательность], [затравка] ); | DATE ( мин, макс, [последовательность], [затравка] ); | TIME ( мин, макс, [последовательность], [затравка] ); | DATETIME ( мин, макс, [последовательность], [затравка] ); | STRING ( мин, макс, [чс], [затравка] ); | REGEX ( рег_выр, [затравка] ); | FILE ( путь, [последовательность], [затравка], [кодировка] ); | REFERENCE ( таблица, столбец, [последовательность], [затравка] );

source: Integer numbers
ru: Целые числа

source: INTEGER ( min, max, [sequence], [seed] ); INTEGER ( -10, 10, 1, 123456 );
ru: INTEGER ( мин, макс, [последовательность], [затравка] ); INTEGER ( -10, 10, 1, 123456 );

source: ``min`` is an integer, ``max`` is an integer, ``sequence`` is an integer and ``seed`` is an integer.
ru: Здесь ``мин``, ``макс``, ``последовательность`` и ``затравка`` — целые числа.

source: Real numbers
ru: Вещественные числа

source: REAL ( min, max, precision, [sequence], [seed] ); REAL ( 1.5, 1.8, 2, 1 );
ru: REAL ( мин, макс, точность, [последовательность], [затравка] ); REAL ( 1.5, 1.8, 2, 1 );

source: ``min`` is a number, ``max`` is a number, ``precision`` is an integer that indicates the number of decimals (should be less than 30), ``sequence`` is an integer and ``seed`` is an integer.
ru: Здесь ``мин`` и ``макс`` — числа, ``точность`` — целое число, задающее число десятичных знаков (должно быть меньше 30), ``последовательность`` и ``затравка`` — также целые числа.

source: Dates
ru: Даты

source: DATE ( min, max, [sequence], [seed] ); DATE ( '2008-05-01', '2008-05-05', 0 );
ru: DATE ( мин, макс, [последовательность], [затравка] ); DATE ( '2008-05-01', '2008-05-05', 0 );

source: ``min`` is a string representing a date, ``max`` is a string representing a date, ``sequence`` is an integer and ``seed`` is an integer.
ru: Здесь ``мин`` и ``макс`` — строковые представления даты, а ``последовательность`` и ``затравка`` — целые числа.

source: Times
ru: Время

source: TIME ( min, max, [sequence], [seed] ); TIME ( '00:30:00', '00:30:15', 0 );
ru: TIME ( мин, макс, [последовательность], [затравка] ); TIME ( '00:30:00', '00:30:15', 0 );

source: ``min`` is a string representing a time, ``max`` is a string representing a time, ``sequence`` is an integer and ``seed`` is an integer.
ru: Здесь ``мин`` и ``макс`` — строковые представления времени, а ``последовательность`` и ``затравка`` — целые числа.

source: Timestamps (date/times)
ru: Даты с временем

source: DATETIME ( min, max, [sequence], [seed] ); DATETIME ( '2008-05-01 14:00:00', '2008-05-05 15:00:00', 1 );
ru: DATETIME ( мин, макс, [последовательность], [затравка] ); DATETIME ( '2008-05-01 14:00:00', '2008-05-05 15:00:00', 1 );

source: ``min`` is a string representing a timestamp, ``max`` is a string representing a timestamp, ``sequence`` is an integer and ``seed`` is an integer.
ru: Здесь ``мин`` и ``макс`` — строковые представления даты с временем, а ``последовательность`` и ``затравка`` — целые числа.

source: STRING ( min, max, [nb], [seed] ); STRING ( 10, 20, 5 );
ru: STRING ( мин, макс, [чс], [затравка] ); STRING ( 10, 20, 5 );

source: ``min`` is an integer representing the minimum length of a word, ``max`` is an integer representing the maximum length of a word, ``nb`` is an integer representing the number of words (default: ``1``) and ``seed`` is an integer.
ru: Здесь ``мин`` — целое число, представляющее минимальную длину слова, ``макс`` — целое, представляющее максимальную длин, ``чс`` — целое, представляющее число слов (по умолчанию: ``1``) и ``затравка`` — целое число.

source: In the above example we generate 5 words (separated with a space) whose size is between 10 and 20 characters.
ru: В показанном выше примере мы генерируем 5 слов (разделённых пробелами), размер которых варьируется от 10 до 20 символов.

source: Strings from regular expressions
ru: Генерация строк из регулярных выражений

source: REGEX ( regex, [seed] ); REGEX ( '[a-z]{1,3}@[0-9]{3}' );
ru: REGEX ( рег_выр, [затравка] ); REGEX ( '[a-z]{1,3}@[0-9]{3}' );

source: ``regex`` is a string representing a simplified regular expressions and ``seed`` is an integer.
ru: Здесь ``рег_выр`` — это строка, представляющая упрощённое регулярное выражение, а ``затравка`` — целое число.

source: Simplified regular expressions are composed of:
ru: Упрощённые регулярные выражения состоят из:

source: Sets of possible characters like ``[a-z_.]`` for characters between ``a`` and ``z`` + ``_`` and ``.``
ru: Наборов возможных символов, как например, набора ``[a-z_.]``, включающего символы от ``a`` до ``z`` и ``_`` с ``.``

source: Single characters
ru: Одиночных символов

source: It is possible to specify the minimum and maximum length of the preceding set or single character:
ru: При этом возможно указать минимальную и максимальную длину предшествующего набора или повторений одиночного символа:

source: ``{min, max}`` like ``{1,3}`` which stands for length between ``1`` and ``3``
ru: ``{мин, макс}`` в виде ``{1,3}``, что будет воспринято как указание длины от ``1`` до ``3``

source: ``{min}`` like ``{3}`` which stands for length of ``3``
ru: ``{мин}`` в виде ``{3}`` воспринимается как длина, равная ``3``

source: Default (when nothing is specified) is length of ``1``
ru: По умолчанию (когда не указано ничего) длина считается равной ``1``

source: Note: be careful with spaces because ``'a {3}'`` means one ``a`` followed by three spaces because the ``3`` is about the last character or set of characters which is a space in this example.
ru: Замечание: будьте осторожны с пробелами, так как запись ``'a {3}'`` означает букву ``a``, за которой идут три пробела, так как ``3`` относится к последнему символу или набору символов перед ней, а это пробел в данном примере.

source: If you need to use ``[`` ``]`` ``\`` ``{`` or ``}``, they must be escaped because they are special characters. Remember to use **double backslash**: ``'\\[{3}'`` for three ``[``.
ru: Если вам нужно использовать ``[`` ``]`` ``\`` ``{`` или ``}``, их нужно экранировать, так как это специальные символы. Чтобы получить три ``[``, добавьте **две обратных косых черты**: ``'\\[{3}'``.

source: Strings from dictionary files
ru: Генерация строк из словарных файлов

source: FILE ( path, [sequence], [seed], [encoding] ); FILE ( 'file.txt', 0, 54321, 'utf-8' );
ru: FILE ( путь, [последовательность], [затравка], [кодировка] ); FILE ( 'file.txt', 0, 54321, 'utf-8' );

source: ``path`` is a string representing the path to a text file, ``sequence`` is an integer, ``seed`` is an integer and ``encoding`` is a string representing the file character set (default is system encoding).
ru: Здесь ``путь`` — это строка, представляющая путь к текстовому файлу, ``последовательность`` и ``затравка`` — целые числа, а ``кодировка`` — строка, представляющая набор символов, содержащихся в файле (по умолчанию выбирается системная кодировка).

source: This generates a random integer between 1 and the number of lines in the file and then returns that line. If the file does not exist then an exception is thrown.
ru: При этом генерируется случайное целое число между 1 и числом строк в файле и возвращается эта строка. Если файл не существует, выдаётся исключение.

source: ``encoding`` supports the most known encoding like utf-8, utf-16le, utf-16be, iso-8859-1, ...
ru: В качестве ``кодировки`` поддерживаются наиболее распространённые, в частности utf-8, utf-16le, utf-16be, iso-8859-1, ...

source: Reference to another field
ru: Ссылка на другое поле

source: REFERENCE ( table, column, [sequence], [seed] ); REFERENCE ( 'tab', 'col', 1 );
ru: REFERENCE ( таблица, столбец, [последовательность], [затравка] ); REFERENCE ( 'tab', 'col', 1 );

source: ``table`` is a string representing a table, ``column`` is a string representing a column of the table, ``sequence`` is an integer and ``seed`` is an integer.
ru: Здесь ``таблица`` — строка, представляющая таблицу, ``столбец`` — строка, представляющая столбец этой таблицы, а ``последовательность`` и ``затравка`` — целые числа.

source: This is useful for generating data to put into foreign-key-constrained columns.
ru: Это бывает полезно для генерирования данных, помещаемых в столбцы, ограниченные внешними ключами.
