Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/pgscript.po
Languages: ru

source: `pgScript Scripting Language Reference`:index:
ru: `Справка по языку скриптов pgScript`:index:

source: Overview
ru: Обзор

source: pgScript is composed of pgScript commands::
ru: Скрипт на языке pgScript может включать следующие команды::

source: pgScript command : Regular PostgreSQL SQL Command (SELECT INSERT CREATE ...) | Variable declaration or assignment (DECLARE SET) | Control-of-flow structure (IF WHILE) | Procedure (ASSERT PRINT LOG RMLINE)
ru: Команды pgScript: Обычные SQL-команды PostgreSQL (SELECT INSERT CREATE ...) | Объявления или присвоения переменных (DECLARE SET) | Конструкции для управления выполнением (IF WHILE) | Процедуры (ASSERT PRINT LOG RMLINE)

source: Command names (**SELECT**, **IF**, **SET**, ...) are case-insensitive and must be ended with a semi-column ``;``. Identifiers are case-sensitive.
ru: Имена команд (**SELECT**, **IF**, **SET**, ...) могут записываться в любом регистре и должны заканчиваться точкой с запятой ``;``. Идентификаторы задаются с учётом регистра.

source: Examples
ru: Примеры

source: Batch table creations
ru: Создание набора таблиц

source: DECLARE @I, @T; -- Variable names begin with a @ SET @I = 0; -- @I is an integer WHILE @I &lt; 20 BEGIN SET @T = 'table' + CAST (@I AS STRING); -- Casts @I CREATE TABLE @T (id integer primary key, data text); SET @I = @I + 1; END
ru: DECLARE @I, @T; -- Имена переменных начинаются с @ SET @I = 0; -- @I — это целое число WHILE @I &lt; 20 BEGIN SET @T = 'table' + CAST (@I AS STRING); -- Приведение @I CREATE TABLE @T (id integer primary key, data text); SET @I = @I + 1; END

source: Insert random data
ru: Добавление случайных данных

source: DECLARE @I, @J, @T, @G; SET @I = 0; SET @G1 = INTEGER(10, 29, 1); /* Random integer generator Unique numbers between 10 and 29 */ SET @G2 = STRING(10, 20, 3); /* Random string generator 3 words between 10 and 20 characters */ WHILE @I &lt; 20 BEGIN SET @T = 'table' + CAST (@I AS STRING); SET @J = 0; WHILE @J &lt; 20 BEGIN INSERT INTO @T VALUES (@G1, '@G2'); SET @J = @J + 1; END SET @I = @I + 1; END
ru: DECLARE @I, @J, @T, @G; SET @I = 0; SET @G1 = INTEGER(10, 29, 1); /* Генератор случайных чисел Выдаёт число от 10 до 29 */ SET @G2 = STRING(10, 20, 3); /* Генератор случайных строк Выдаёт 3 слова от 10 до 20 символов длиной*/ WHILE @I &lt; 20 BEGIN SET @T = 'table' + CAST (@I AS STRING); SET @J = 0; WHILE @J &lt; 20 BEGIN INSERT INTO @T VALUES (@G1, '@G2'); SET @J = @J + 1; END SET @I = @I + 1; END

source: Batch table deletions
ru: Удаление набора таблиц

source: DECLARE @I, @T; -- Declaring is optional SET @I = 0; WHILE 1 -- Always true BEGIN IF @I &gt;= 20 BREAK; -- Exit the loop if @I &gt; 20 SET @T = 'table' + CAST (@I AS STRING); DROP TABLE @T; SET @I = @I + 1; END
ru: DECLARE @I, @T; -- Объявлять переменные необязательно SET @I = 0; WHILE 1 -- Always true BEGIN IF @I &gt;= 20 BREAK; -- Выйти из цикла, когда @I &gt; 20 SET @T = 'table' + CAST (@I AS STRING); DROP TABLE @T; SET @I = @I + 1; END

source: Print information on screen
ru: Вывод информации на экран

source: SET @PROGR@M#TITLE = 'pgScript'; PRINT ''; PRINT @PROGR@M#TITLE + ' features:'; PRINT ''; PRINT ' * Regular PostgreSQL commands'; PRINT ' * Control-of-flow language'; PRINT ' * Local variables'; PRINT ' * Random data generators';</pre>
ru: SET @PROGR@M#TITLE = 'pgScript'; PRINT ''; PRINT @PROGR@M#TITLE + ' предлагает:'; PRINT ''; PRINT ' * Обычные команды PostgreSQL'; PRINT ' * Язык управления выполнением'; PRINT ' * Локальные переменные'; PRINT ' * Генераторы случайных данных';</pre>

source: SQL Commands
ru: Команды SQL

source: You can run ANY PostgreSQL query from a pgScript EXCEPT those ones::
ru: В pgScript вы можете выполнять ЛЮБЫЕ запросы PostgreSQL, КРОМЕ::

source: This is because **BEGIN** and **END** are used for delimiting blocks. Instead use::
ru: Это связано с тем, что слова **BEGIN** и **END** используются для разделения блоков. Вместо них применяйте::

source: For a list of PostgreSQL commands: `http://www.postgresql.org/docs/8.3/interactive/sql-commands.html <http://www.postgresql.org/docs/8.3/interactive/sql-commands.html>`_
ru: Список команд PostgreSQL вы можете найти в документации: `https://postgrespro.ru/docs/postgresql/current/sql-commands.html <https://postgrespro.ru/docs/postgresql/current/sql-commands.html>`_

source: Variables
ru: Переменные

source: There are two main types of variables : simple variables and records (result sets composed of lines and columns).
ru: Есть два основных типа переменных: простые переменные и записи (наборы результатов, состоящие из строк и столбцов).

source: Variable names begin with a ``@`` and can be composed of letters, digits, ``_``, ``#``, ``@``.
ru: Имена переменных начинаются с символа ``@`` и могут содержать буквы, цифр и символы ``_``, ``#``, ``@``.

source: Variable type is guessed automatically according to the kind of value it contains. This can be one of: number (real or integer), string, record.
ru: Тип переменных выбирается автоматически по типу значения, которое в ней содержится. Это может быть число (вещественное или целое), строка или запись.

source: Simple variables
ru: Простые переменные

source: Simple variable declaration
ru: Объявление простой переменной

source: Declaring simple variable is optional::
ru: Объявление простой переменной не является обязательным и выглядит так::

source: Simple variable affectation
ru: Инициализация простой переменной

source: This is done with the **SET** command. The variable type depends on the value assigned to this variable::
ru: Это осуществляется с помощью команды **SET**. Тип переменной будет зависеть от значения, назначенного ей::

source: SET @A = 1000, @B = 2000; -- @A and @B are <strong>integer numbers** SET @C = 10e1, @D = 1.5; -- @C and @D are <strong>real numbers** SET @E = 'ab', @F = 'a''b'; -- @E and @F are <strong>strings** SET @G = "ab", @H = "a\"b"; -- @G and @H are <strong>strings**
ru: SET @A = 1000, @B = 2000; -- @A и @B — **целые числа** SET @C = 10e1, @D = 1.5; -- @C и @D — **вещественные числа** SET @E = 'ab', @F = 'a''b'; -- @E и @F — **строки** SET @G = "ab", @H = "a\"b"; -- @G и @H — **строки**

source: An uninitialized variable defaults to an empty string. It is possible to override variables as many times as wanted::
ru: Неинициализированная переменная считается содержащей пустую строку. Значения переменных можно переопределять сколько угодно раз:

source: PRINT @A; -- Prints an empty string SET @A = 1000; -- @A is initialized an integer PRINT @A; -- Prints 1000 SET @A = 'ab'; -- @A becomes a string PRINT @A; -- Prints ab
ru: PRINT @A; -- Выводится пустая строка SET @A = 1000; -- @A получает целое значение PRINT @A; -- Выводится 1000 SET @A = 'ab'; -- @A становится строковой PRINT @A; -- Выводится ab

source: Data generators
ru: Генераторы данных

source: Data generators allows users to generate random values. There are various types of generators, each one producing different type of data. A variable initialized with a data generator behaves like a regular simple variable except that it has a different value each time it is used::
ru: Генераторы данных позволяют пользователям получать случайные значения. Генераторы бывают различных типов и отличаются они типами генерируемых данных. Переменная, проинициализированная генератором данных, ведёт себя как обычная переменная, за исключением того, что при каждом использовании она принимает новое значение::

source: SET @A = INTEGER(100, 200); PRINT @A; -- Prints an integer between 100 and 200 PRINT @A; -- Prints another integer between 100 and 200
ru: SET @A = INTEGER(100, 200); PRINT @A; -- Выводится целое от 100 до 200 PRINT @A; -- Выводится ещё одно целое от 100 до 200

source: A variable can contain a generator but its type is one of: number (real or integer), string. For a list of available generators and their associated type, see `generators`_.
ru: Переменная может содержать генератор, но её типом будет числовой (вещественная или целая) или строка. Полный список доступных генераторов и связанных с ними типов приведён :ref:`ниже <generators>`.

source: Records
ru: Записи

source: Record declaration
ru: Объявление записи

source: Declaring a record is **required**. A name for each column must be specified even if they will not be used anymore afterwards::
ru: Объявлять записи **обязательно**. При этом необходимо задать имя для каждого столбца, даже для тех, что впоследствии не будут использоваться::

source: DECLARE @R1 { @A, @B }, @R2 { @A, @C }; -- Two records with two columns DECLARE @R3 { @A, @B, @C, @D }; -- One record with four columns
ru: DECLARE @R1 { @A, @B }, @R2 { @A, @C }; -- Две записи с двумя столбцами DECLARE @R3 { @A, @B, @C, @D }; -- Одна запись с четырьмя столбцами

source: The number of lines is dynamic: see the next section.
ru: Число строк определяется динамически: см. следующий раздел.

source: Record affectation
ru: Манипуляции с записями

source: To access a specific location in a record, one must use the line number (starts at 0) and can use either the column name (between quotes) or the column number (starts at 0). This specific location behaves like a simple variable. Note that a record cannot contain a record::
ru: Чтобы обратиться к определённой ячейке в записи, нужно задать номер строки (начинается с 0) и можно задать либо имя столбца (заключённое в кавычки), либо его номер (начиная с 0). Такая ссылка на ячейку действует как простая переменная. Заметьте, что запись не может содержать запись::

source: SET @R1[0]['@A'] = 1; -- First line &amp; first column SET @R1[0][0] = 1; -- Same location SET @R1[4]['@B'] = 1; -- Fifth line &amp; second column SET @R1[0][1] = 1; -- Same location
ru: SET @R1[0]['@A'] = 1; -- Первая строка, первый столбец SET @R1[0][0] = 1; -- Та же ячейка SET @R1[4]['@B'] = 1; -- Пятая строка, второй столбец SET @R1[0][1] = 1; -- Та же ячейка

source: In the above example, three empty lines are automatically inserted between the first and the fifth. Using an invalid column number or name results in an exception.
ru: В показанном выше примере между первой и пятой строками автоматически вставляются три пустые строки. При попытке указать недопустимый номер столбца или имя возникает исключение.

source: Specific location can be used as right values as well. A specific line can also be used as right value::
ru: Ссылка на ячейку может также фигурировать в правой части присваивания. Кроме того, справа может фигурировать и определённая строка записи::

source: SET @R1[0][0] = @R3[0][1], @A = @R2[0][0]; -- Behaves like simple variables SET @A = @R1[1]; -- @A becomes a record which is the first line of @R1
ru: SET @R1[0][0] = @R3[0][1], @A = @R2[0][0]; -- То же поведение, что и простых переменных SET @A = @R1[1]; -- @A становится записью, содержащей первую строку @R1

source: Remember that ``SET @R1[0][0] = @R2`` is impossible because a record cannot contain a record.
ru: Помните, что запись ``SET @R1[0][0] = @R2`` невозможна, так как запись не может содержать запись.

source: It is possible to assign a record to a variable, in this case the variable does not need to be declared::
ru: Переменной можно присвоить запись, и в этом случае объявлять переменную необязательно::

source: SET @A = @R3; -- @A becomes a record because it is assigned a record
ru: SET @A = @R3; -- @A становится записью, потому что ей присваивается запись

source: SQL queries
ru: SQL-запросы

source: Any SQL query executed returns a record. If the query is a ``SELECT`` query then it returns the results of the query. If it is something else then it returns a one-line record (``true``) if this is a success otherwise a zero-line record (``false``)::
ru: Выполненный SQL-запрос возвращает запись. Если это запрос ``SELECT``, то это запись с результатами запроса. Если это что-то другое, то возвращается запись с одной строкой (``true``) в случае успеха, и запись без строк (``false``) в противном случае::

source: SET @A = SELECT * FROM table; -- @A is a record with the results of the query SET @B = INSERT INTO table ...; -- @B is a one-line record if the query succeeds
ru: SET @A = SELECT * FROM table; -- @A — запись с результатами запроса SET @B = INSERT INTO table ...; -- @B — запись с одной строкой в случае успеха запроса

source: Record functions
ru: Функции для работы с записями

source: See `function2`_.
ru: См. :ref:`описание функций <function2>`.

source: Cast
ru: Приведения

source: It is possible to convert a variable from one type to another with the cast function::
ru: Тип переменной можно сменить с одного на другой с помощью функции приведения::

source: When a record is converted to a string, it is converted to its flat representation. When converted to a number, the record is first converted to a string and then to a number (see string conversion for more details).
ru: Когда запись преобразуется в строку, она переводится в плоское представление. Когда она преобразуется в число, сначала она переводится в строку, а затем в число (за подробностями обратитесь к описанию преобразования строк).

source: When a number is converted to a string, it is converted to its string representation. When converted to a record, it is converted to a one-line-one-column record whose value is the number.
ru: Когда число преобразуется в строку, оно переводится в своё текстовое представление. Когда оно преобразуется в запись, оно становится записью с одной строкой и одним столбцом, содержащим это число.

source: When a string is converted to a number, if the string represents a number then this number is returned else an exception is thrown. When converted to a record, either the program can find a **record pattern** in the string or it converts it to a one-line-one-column record whose value is the string. A record pattern is::
ru: Когда строка преобразуется в число, то, если она представляет число, возвращается оно, а в противном случае выдаётся исключение. При преобразовании текстовой строки в запись программа может либо найти в этом столбце **шаблон записи**, либо преобразовать её в запись с одной строкой и одним столбцом, который и будет содержать начальную строку. Шаблон записи имеет следующий вид::

source: SET @B = '(1, "abc", "ab\\"")(1, "abc", "ab\\"")'; -- @B is a string SET @B = CAST (@B AS RECORD); @B becomes a two-line-three-column record
ru: SET @B = '(1, "abc", "ab\\"")(1, "abc", "ab\\"")'; -- @B — это строка SET @B = CAST (@B AS RECORD); @B становится записью с двумя строками и тремя столбцами

source: Remember a string is surrounded by simple quotes. Strings composing a record must be surrounded by double quotes which are escaped with ``\\`` (we double the slash because it is already a special character for the enclosing simple quotes).
ru: Помните, что строка должна заключаться в апострофы. При этом строки, составляющие запись, должны заключаться в кавычки, экранируемые символами ``\\`` (обратную косую черту нужно продублировать, так как она сама по себе спецсимвол для экранирования апострофов).

source: Operations
ru: Операции

source: Operations can only be performed between operands of the same type. Cast values in order to conform to this criterion.
ru: Операции можно выполнить только с операндами одного типа. Для удовлетворения этого требования можно выполнить приведение значений.

source: Comparisons result in a number which is 0 or 1.
ru: Результатом сравнения является число, равное 0 или 1.

source: Strings
ru: Строки

source: Comparisons: ``= <> > < <= >= AND OR``
ru: Сравнения: ``= <> > < <= >= AND OR``

source: Concatenation: ``+``
ru: Конкатенация: ``+``

source: SET @B = @A + 'abcdef'; -- @A must be a string and @B will be a string
ru: SET @B = @A + 'abcdef'; -- @A должна быть строковой переменной и @B будет строкой

source: Boolean value: non-empty string is ``true``, empty string is ``false``
ru: Логическое значение: непустая строка — ``истина``, пустая — ``ложь``

source: Inverse boolean value: ``NOT``
ru: Обратное логическое значение: ``NOT``

source: Case-insensitive comparison: ``~=``
ru: Сравнение без учёта регистра: ``~=``

source: Numbers
ru: Числа

source: Arithmetic: ``+ - * / %``
ru: Арифметические операции: ``+ - * / %``

source: SET @A = CAST ('10' AS INTEGER) + 5; -- '10' string is converted to a number
ru: SET @A = CAST ('10' AS INTEGER) + 5; -- строка '10' преобразуется в число

source: Boolean value: 0 is ``false``, anything else is ``true``
ru: Логическое значение: 0 — ``ложь``, всё остальное — ``истина``

source: Inverse boolean value: ``NOT`` (note that ``NOT NOT 10 = 1``)
ru: Обратное логическое значение: ``NOT`` (заметьте, что ``NOT NOT 10 = 1``)

source: An arithmetic operation involving at least one real number gives a real number as a result::
ru: Арифметическая операция, в которое задействуется хотя бы одно вещественное число, выдаёт вещественное число в результате::

source: SET @A = 10 / 4.; -- 4. is a real so real division: @A = 2.5 SET @A = 10 / 4; -- 4 is an integer so integer division: @A = 2
ru: SET @A = 10 / 4.; -- 4. — вещественное число, так что деление вещественное: @A = 2.5 SET @A = 10 / 4; -- 4 — целое, поэтому деление целочисленное: @A = 2

source: Boolean value: zero-line record is ``false``, anything else is ``true``
ru: Логическое значение: запись нулевой длины — ``ложь``, всё остальное — ``истина``

source: Comparisons for records are about inclusion and exclusion. Order of lines does not matter. ``<=`` means that each row in the left operand has a match in the right operand. ``>=`` means the opposite. ``=`` means that ``<=`` and ``>=`` are both true at the same time...
ru: Операции сравнения записей оценивают вхождение и исключений значений. Порядок строк при этом не имеет значения. Условие ``<=`` истинно, если для каждой строки левого операнда находится вхождение в правом операнде. Условие ``>=`` истинно в противоположном случае. Условие ``=`` истинно, когда ``<=`` и ``>=`` истинны одновременно...

source: Comparisons are performed on strings: even if a record contains numbers like ``10`` and ``1e1`` we will have ``'10' <> '1e1'``.
ru: Сравнения выполняются со строками: даже если записи содержат числа, например с числами ``10`` и ``1e1`` будет получено ``'10' <> '1e1'``.

source: Control-of-flow structures
ru: Управление потоком выполнения

source: Conditional structure
ru: Конструкция условия

source: IF condition BEGIN pgScript commands END ELSE BEGIN pgScript commands END
ru: IF условие BEGIN команды pgScript END ELSE BEGIN команды pgScript END

source: pgScript commands are optional. **BEGIN** and **END** keywords are optional if there is only one pgScript command.
ru: Команды pgScript могут отсутствовать. Слова **BEGIN** и **END** являются необязательными в случае указания ровно одной команды pgScript.

source: Loop structure
ru: Конструкция цикла

source: WHILE condition BEGIN pgScript commands END
ru: WHILE условие BEGIN команды pgScript END

source: **BREAK** ends the enclosing **WHILE** loop, while **CONTINUE** causes the next iteration of the loop to execute. **RETURN** behaves like **BREAK**::
ru: **BREAK** прерывает окружающий цикл **WHILE**, а **CONTINUE** запускает следующую итерацию цикла. **RETURN** действует подобно команде **BREAK**::

source: WHILE condition1 BEGIN IF condition2 BEGIN BREAK; END END
ru: WHILE условие1 BEGIN IF условие2 BEGIN BREAK; END END

source: Conditions
ru: Условия

source: Conditions are in fact results of operations. For example the string comparison ``'ab' = 'ac'`` will result in a number which is ``false`` (the equality is not true)::
ru: Условия на самом деле являются результатами операций. Например, сравнение строк ``'ab' = 'ac'`` даёт результат ``ложь`` (равенство не выполняется)::

source: IF 'ab' ~= 'AB' -- Case-insensitive comparison which result in 1 (true) which is true BEGIN -- This happens END IF 0 -- false BEGIN -- This does **not** happen END ELSE BEGIN -- This happens END WHILE 1 BEGIN -- Infinite loop: use BREAK for exiting END
ru: IF 'ab' ~= 'AB' -- Сравнение без учёта регистра даёт результат 1 (истина) BEGIN -- Это выполняется END IF 0 -- ложь BEGIN -- Это **не** выполняется END ELSE BEGIN -- Это выполняется END WHILE 1 BEGIN -- Бесконечный цикл: для выхода примените BREAK END

source: It is possible to the result of a SQL SELECT query directly as a condition. The query needs to be surrounded by parenthesis::
ru: Результат SQL-запроса SELECT можно задействовать непосредственно в условии. Для этого запрос нужно заключить в скобки::

source: IF (SELECT 1 FROM table) BEGIN -- This means that table exists otherwise the condition would be false END
ru: IF (SELECT 1 FROM table) BEGIN -- Это выполняется, если таблица существует, в противном случае результат условия будет ложным END

source: Additional functions and procedures
ru: Дополнительные функции и процедуры

source: Procedures
ru: Процедуры

source: Procedures do not return a result. They must be used alone on a line and cannot be assigned to a variable.
ru: Процедуры не возвращают результат. Их вызов должен записываться в отдельной строке и он не может присваиваться переменной.

source: Print
ru: Вывод

source: Prints an expression on the screen::
ru: Выводит выражение на экран::

source: PRINT 'The value of @A is' + CAST (@A AS STRING);
ru: PRINT 'Значение @A: ' + CAST (@A AS STRING);

source: Assert
ru: Отладочное утверждение

source: Throws an exception if the expression evaluated is false::
ru: Выдаёт исключение при ложном результате выражения::

source: Remove line
ru: Удаление строки

source: Removes the specified line of a record::
ru: Удаляет определённую строку записи::

source: RMLINE(@R[1]); -- Removes @R second line
ru: RMLINE(@R[1]); -- Удаляет вторую строку @R

source: Functions
ru: Функции

source: Functions do return a result. Their return value can be assigned to a variable, like the ``CAST`` operation.
ru: Функции возвращают результат. Возвращённое имя значение можно присвоить переменной, как результат операции ``CAST``.

source: Removes extra spaces surrounding a string::
ru: Удаляет лишние пробелы, окружающие строку::

source: Lines
ru: Табличные строки

source: Gives the number of lines in a record::
ru: Возвращает число строк в записи::

source: IF LINES(@R) &gt; 0 BEGIN -- Process END
ru: IF LINES(@R) &gt; 0 BEGIN -- Обработка END

source: Columns
ru: Столбцы

source: Gives the number of columns in a record::
ru: Выдаёт число столбцов в записи::

source: IF COLUMNS(@R) &gt; 0 BEGIN -- Process END
ru: IF COLUMNS(@R) &gt; 0 BEGIN -- Обработка END

source: Random data generators
ru: Генераторы случайных данных

source: Overview of the generators
ru: Обзор генераторов

source: One can assign a variable (**SET**) with a random data generators. This means each time the variable will be used it will have a different value.
ru: Переменной можно назначить (**SET**) генератор случайных данных. Это означает, что при каждом использовании переменной она будет иметь другое, случайное значение.

source: However the variable is still used as usual::
ru: В остальном такая переменная используется как обычно:

source: SET @G = STRING(10, 20, 2); SET @A = @G; -- @A will hold a random string SET @B = @G; -- @B will hold another random string PRINT @G, -- This will print another third random string
ru: SET @G = STRING(10, 20, 2); SET @A = @G; -- @A будет содержать случайную строку SET @B = @G; -- @B будет содержать другую случайную строку PRINT @G, -- Эта команда выведет третью случайную строку

source: Sequence and seeding
ru: Последовательность и начальное значение

source: Common parameters for data generators are *sequence* and *seed*.
ru: Для генераторов данных часто дополнительно задаются параметры *последовательность* и *затравка*.
