Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/query.po
Languages: ru_ru

source: `Query tool`:index:
ru_ru: `Запросник`:index:

source: The Query Tool enables you to execute arbitrary SQL commands.
ru_ru: Инструмент *Запросник* позволяет вам выполнять произвольные команды SQL.

source: The upper part of the Query Tool contains the SQL Editor where you type your commands. You may read the query from a file, or write it out to a file. When writing a file, the encoding of the file is determined by the file suffix: if it is \*.sql, a 8 bit local character set is used. If \*.usql is selected, the file will be written in UTF-8, which enables the storage of virtually all characters used throughout the world, according to the coding rules of the `Unicode Consortium <http://www.unicode.org>`_. If you select \*.\*, the setting from the :ref:`read/write unicode option <options-query_tool>` is used.
ru_ru: В верхней части *Запросника* находится *Редактор SQL*, в котором вы вводите команды. Текст команд или запроса вы можете прочитать из файла и записать в файл. При записи в файл кодировка вывода определяется по расширению файла: для расширений \*.sql применяется 8-битовая локальная кодировка, а для расширений \*.usql — UTF-8, что позволяет сохранить практически любые символы, существующие в мире, согласно правилам, установленным `консорциумом Unicode <http://www.unicode.org>`_. Если вы выберете маску файла \*.\*, будет действовать параметр :ref:`Читать и записывать файлы в формате UTF-8 <options-query_tool>`.

source: The edit entry window also contains autocompletion code to help you write queries. To use autocomplete, simply start typing your query and then press Control+Space to see a list of possible object names to insert. For example, type "\*SELECT \* FROM\* " (without the quotes, but with the trailing space), and then hit Control and Space together to see a popup menu of autocomplete options. The autocomplete system is based on code from *psql*, the PostgreSQL command line interpreter and will generally be able to offer autocomplete options in the same places that it can in *psql*.
ru_ru: В окне редактора также реализован механизм автодополнения, помогающий писать запросы. Для использования автодополнения просто начните писать ваш запрос, а затем нажмите Control+Пробел, чтобы получить список предлагаемых имён объектов для вставки. Например, введите "\*SELECT \* FROM\* " (без кавычек, но с последним пробелом), а затем нажмите Control вместе с клавишей Пробел, и вы увидите выпадающее меню со списком вариантов автодополнения. Механизм автодополнения основан на коде из *psql*, интерпретатора командной строки PostgreSQL, и в принципе должен предлагать такие же варианты автодополнения, что и *psql*.

source: The editor also offers a number of features for helping with code formatting:
ru_ru: В этом редакторе реализованы и другие дополнительные средства, облегчающие форматирование кода:

source: The auto-indent feature will automatically indent text to the same depth as the previous line when you press return.
ru_ru: Механизм автоотступа будет автоматически отодвигать текст на тот же отступ, что имел место в предыдущей строке, в которой вы нажали Enter.

source: Block indent text by selecting two or more lines and pressing the Tab key.
ru_ru: Отодвигание блока текста, которое осуществляется, когда вы выделяете две или более строк и нажимаете клавишу Tab.

source: Block outdent text that has been indented using the current tab settings using Shift+Tab.
ru_ru: Придвигание блока текста, отодвинутого ранее, с текущими настройками табуляции, сочетанием клавиш Shift+Tab.

source: Comment out SQL by selecting some text and pressing the Control+K.
ru_ru: Комментирование блока SQL, осуществляемое путём выделения текста и нажатия клавиш Control+K.

source: Uncomment SQL by selecting some text starting with a comment and pressing Control+Shift+K.
ru_ru: Раскомментирование SQL, осуществляемое путём выделения текста, начинающегося с комментария, и нажатия Control+Shift+K.

source: Shift the selected text to upper case by pressing Control+U.
ru_ru: Перевод выделенного текста в верхний регистр сочетанием клавиш Control+U.

source: Shift the selected text to lower case by pressing Control+Shift+U.
ru_ru: Перевод выделенного текста в нижний регистр сочетанием клавиш Control+Shift+U.

source: If you prefer to build your queries graphically, you can use the :ref:`gqb` to generate the SQL for you.
ru_ru: Если вы предпочитаете строить запросы в графическом режиме, можно воспользоваться :ref:`Графическим конструктором запросов <gqb>` и он сгенерирует SQL за вас.

source: To execute a query, select Execute from the Query menu, press the execute toolbar button, or press the F5 function key. The complete contents of the window will be sent to the database server, which executes it. You may also execute just a part of the text, by selecting only the text that you want the server to execute.
ru_ru: Чтобы выполнить запрос, выберите в меню *Запрос → Выполнить*, нажмите кнопку *Выполнить* на панели инструментов или нажмите функциональную клавишу F5. Серверу баз данных будет передано всё содержимое окна, и он выполнит все команды в нём. Вы также можете выполнить только фрагмент текста, выделив только тот текст, который хотите передать на выполнение серверу.

source: Options on the *Query* menu allow you to control COMMIT and ROLLBACK behavior for transactions:
ru_ru: В меню *Запрос* имеются пункты, позволяющие настроить поведение COMMIT или ROLLBACK для транзакций:

source: Check the box next to *Auto-Rollback* to instruct the server to automatically roll back a transaction if an error occurs during the transaction.
ru_ru: Отметьте флажок *Автооткат*, чтобы сервер автоматически откатывал транзакцию в случае возникновения ошибки в процессе её выполнения.

source: Check the box next to *Auto-Commit* to instruct the server to automatically commit each transaction. Any changes made by the transaction will be visible to others, and are guaranteed to be durable in the event of a crash. By default, auto-commit behavior is enabled.
ru_ru: Отметьте флажок *Автофиксация*, чтобы сервер автоматически фиксировал каждую транзакцию. Все производимые транзакциями изменения будут видны другим и гарантированно сохранятся в случае сбоя. По умолчанию автофиксация включена.

source: Explain from the Query menu, or F7 function key will execute the EXPLAIN command. The database server will analyze the query that's sent to it, and will return the results.
ru_ru: При выборе в меню *Запрос → Построить план выполнения* или нажатии клавиши F7 серверу передаётся команда EXPLAIN, а он, в свою очередь, анализирует отправленный ему запрос и возвращает результаты.

source: The result is displayed as text in the Data Output page, and graphically visualized on the Explain page. This enables you to find out how the query is parsed, optimized and executed. You can modify the degree of inspection by changing the Explain options for this in the Query menu. Please note that "EXPLAIN VERBOSE" can not be displayed graphically.
ru_ru: Полученный результат выводится в текстовом виде на вкладке *Вывод данных* и визуализируется графически на вкладке *План выполнения*. Это позволяет понять, как запрос будет разбираться, оптимизироваться и исполняться. Вы можете поменять характеристики изучения запроса, изменяя *Параметры построения плана* в меню *Запрос*. Заметьте, что результат команды EXPLAIN VERBOSE непредставим в графическом виде.

source: In case the query you sent to the server using the Execute or Explain command takes longer than you expect, and you would like to abort the execution, you can select Cancel from the Query menu, press the Cancel toolbar button or use Alt-Break function key to abort the execution.
ru_ru: В случае, если отправленный на сервер командами *Выполнить* или *Построить план выполнения* запрос выполняется дольше, чем вы ожидаете, и вы хотели бы прервать его выполнение, вы можете выбрать в меню *Запрос → Отмена*, нажать кнопку *Отмена* на панели инструментов или клавиши Alt-Break.

source: You can run pgScript scripts by selecting Execute pgScript from the Query menu instead of Execute, or you press the Execute pgScript toolbar button, or you press the F6 function key. The complete contents of the edit entry window will be sent to the pgScript engine, which interprets it. pgScript scripts are composed of regular SQL commands but add some enhancements:
ru_ru: Вы также можете выполнять скрипты pgScript, выбрав в меню *Запрос → Выполнить pgScript* вместо *Выполнить*, нажав кнопку *Выполнить pgScript* на панели инструментов либо клавишу F6. При этом всё содержимое окна редактора будет передано исполнителю pgScript, который интерпретирует и выполнит его. Скрипты pgScript состоят из обычных команд SQL, но предлагают расширенные возможности:

source: Control-of-flow language (``IF`` and ``WHILE`` structures)
ru_ru: Управление потоком выполнения (конструкции ``IF`` и ``WHILE``)

source: Local variables (``SET @VARIABLE = 5``)
ru_ru: Локальные переменные (``SET @VARIABLE = 5``)

source: Random data generators (``INTEGER(10, 20)`` or ``REFERENCE(table, column)``)
ru_ru: Генераторы случайных чисел (``INTEGER(10, 20)`` и ``REFERENCE(table, column)``)

source: For more information on the pgScript language, please look at the :ref:`pgScript scripting language reference <pgscript>`.
ru_ru: За дополнительной информацией о языке pgScript обратитесь к :ref:`справке по языку скриптов pgScript <pgscript>`.

source: If you want to have help about a SQL command you want to execute, you can mark a SQL keyword and select SQL Help from the Help menu, the SQL Help toolbar button or simply press the F1 key. pgAdmin III will try to locate the appropriate information in the PostgreSQL documentation for you.
ru_ru: Если вам нужна справка по какой-либо команде SQL, которую вы хотите выполнить, вы можете выделить ключевое слово SQL и выбрать в меню *Справка → Справка по SQL*, нажать кнопку *Справка SQL* на панели инструментов или просто нажать клавишу F1. pgAdmin III попытается найти нужную информацию в документации PostgreSQL для вас.

source: The result of the database server execution will be displayed in the lower part of the Query Tool. If the last command in the chain of SQL command sent to the server was as command returning a result set, this will be shown on the Data Output page. All rowsets from previous commands will be discarded.
ru_ru: Результат выполнения команд сервером баз данных будет показан в нижней части запросника. Если последняя команда в серии SQL-команд, отправленных на сервер, возвратила набор данных, он будет показан на вкладке *Вывод данных*. При этом наборы результатов всех предыдущих команд будут отброшены.

source: To save the data in the Data Output page to a file, you can use the :ref:`Export <export>` dialog.
ru_ru: Чтобы сохранить содержимое вкладки *Вывод данных* в файле, можно воспользоваться диалогом :ref:`Экспорт <export>`.

source: Information about all commands just executed will go to the Messages page. The History page will remember all commands executed and the results from this, until you use Clear History from the Query menu to clear the window. If you want to retain the history for later inspection, you can save the contents of the History page to a file using the Save history option from the Query menu.
ru_ru: Информация обо всех только что выполненных командах выводится на вкладке *Сообщения*. На вкладке *История* будут запоминаться все выполненные команды и результаты выполнения, пока вы не очистите это окно, выбрав в меню *Запрос → Очистить историю*. Если вы хотите сохранить историю для последующего использования, вы можете записать содержимое вкладки *История* в файл, воспользовавшись пунктом меню *Запрос → Сохранить историю*.

source: The status line will show how long the last query took to complete. If a dataset was returned, not only the elapsed time for server execution is displayed, but also the time to retrieve the data about your current selection.
ru_ru: В панели состояния будет показано, сколько времени потребовалось для выполнения последнего запроса. Если запрос возвратил набор данных, будет показано также время, которое заняло получение данных текущего результата.

source: In the toolbar combobox you can quickly change your database connection from one database to another, without launching another instance of the query tool. Initially, only one database will be available, but by selecting <new connection> from the combobox, you can add another connection to it.
ru_ru: В выпадающем списке на панели инструментов вы можете быстро переключиться с одной базы данных на другую, не запуская для этого отдельный запросник. Изначально в этом списке доступна только одна база данных, но выбрав в нём пункт *<новое подключение>*, вы можете добавить в него другое подключение.

source: In the :ref:`options dialog <options-query_tool>`, you can specify a default limit for the rowset size to retrieve. By default, this value will be 100. If the number of rows to retrieve from the server exceeds this value, a message box will appear asking what to do to prevent retrieval of an unexpected high amount of data. You may decide to retrieve just the first rows, as configured with the max rows setting, or retrieving the complete rowset regardless of the setting, or abort the query, effectively retrieving zero rows.
ru_ru: .. image:: stub-to-hide-obsolete-info

source: If you have queries that you execute often, you can add these to the favourites menu, and have them automatically put in the buffer when you select them from the menu. The Manage Favourites menu option may be used to organise your favourites. Alternatively, you can store them as :ref:`macros`.
ru_ru: Если вы выполняете какие-либо запросы регулярно, вы можете добавить их в Избранное, и затем они будут автоматически вставляться в буфер, когда вы будете выбирать их из меню. Для упорядочения избранных запросов вы можете воспользоваться командой меню *Избранное → Управление Избранным*. Вы также можете сохранить такие команды как :ref:`macros`.

source: The Query Tool also includes a powerful Find and Replace tool. In addition to offering the normal options found in most tools, a Regular Expression search mode is included which allows you to perform extremely powerful search (and replace) operations. Unless your copy of pgAdmin was built against a non-standard build of wxWidgets, a built in version of Henry Spencer's regular expression library is used based on the 1003.2 spec and some (not quite all) of the Perl5 extensions.
ru_ru: В запроснике также имеется мощное средство поиска и замены. В дополнение к обычным возможностям, предлагаемых многими программами, он имеет режим регулярных выражений, который позволяет выполнять очень сложные операции поиска (и замены). Если только ваша копия pgAdmin не была собрана с нестандартной сборкой wxWidgets, для этого используется библиотека регулярных выражений Генри Спенсера, реализующая спецификацию 1003.2 и некоторые (не все) расширения Perl5.

source: For more details of the regular expression syntax offered, please see the `wxWidgets documentation <http://www.wxwindows.org/manuals/2.6.3/wx_wxresyn.html#wxresyn>`_.
ru_ru: За дополнительной информацией о синтаксисе регулярных выражений обратитесь к `документации wxWidgets <http://www.wxwindows.org/manuals/2.6.3/wx_wxresyn.html#wxresyn>`_.

source: Contents:
ru_ru: Содержание:
