Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/reports.po
Languages: ru_ru

source: `Report Tool`:index:
ru_ru: `Генератор отчётов`:index:

source: pgAdmin includes a simple reporting engine which allows you to quickly generate reports from the queries you write in the :ref:`Query Tool <query>`, or from objects or collections of objects in the main application Window - for example, you can create a report of the properties of any object, or a list of functions in a schema. To create a report, select a node in the browser treeview, and select the report to create from the context menu, or from the Reports submenu of the Tools menu. To create a report in the Query Tool, select the Quick Report option from the File menu.
ru_ru: В pgAdmin встроен простой механизм построения отчётов, позволяющий быстро генерировать отчёты по результатам запросов, которые вы пишете в :ref:`Запроснике <query>`, или по объектам либо коллекциям объектов в основном окне приложения — например, вы можете построить отчёт по свойствам любого объекта или списку функций в схеме. Чтобы построить отчёт, выделите объект в дереве, а затем выберите отчёт, который вы хотите получить, в контекстном меню либо в меню *Инструменты → Отчёты*. Чтобы построить отчёт в запроснике, выберите в меню *Файл → Быстрый отчёт*.

source: Each report contains a title and optional notes that can be modified before the report is produced. In addition, you may select whether or not to include any SQL that may be relevant to the report you have selected.
ru_ru: Каждый отчёт содержит заголовок и дополнительные заметки, которые можно написать/отредактировать до построения отчёта. Кроме того, вы можете выбрать, включать ли в отчёт какие-либо SQL-команды, имеющие отношение к создаваемому отчёту.

source: Reports are generated internally in XML, however pgAdmin can apply an XML stylesheet to the report at processing time to format the output as required. A default stylesheet is built-in which produces HTML output. With the HTML output option selected, you can opt to embed the default CSS stylesheet (which will render the report in the same colors as the pgAdmin website), to embed an external stylesheet into the report, or to link to an external stylesheet. The following class/object ID's are used:
ru_ru: Отчёты внутри генерируются в XML, но pgAdmin может применить к XML преобразование для получения нужного представления результата. Встроенный стиль позволяет получить вывод в формате HTML. Если выбран формат вывода XHTML, вы можете по желанию внедрить в отчёт стандартную таблицу стилей CSS (с которой отчёт будет раскрашен теми и же цветами, что и сайт pgAdmin), внедрить внешнюю таблицу стилей или вставить ссылку на внешнюю таблицу. При этом в отчёте будут использоваться следующие классы/идентификаторы элементов:

source: **#ReportHeader**: This div contains the report header.
ru_ru: **#ReportHeader**: Этот элемент div содержит заголовок отчёта.

source: **#ReportNotes**: This div contains the option report notes.
ru_ru: **#ReportNotes**: Этот элемент div содержит необязательные примечания к отчёту.

source: **#ReportDetails**: This div contains the main body of the report.
ru_ru: **#ReportDetails**: Этот div содержит основной тело отчёта.

source: **#ReportFooter**: This div contains the report footer.
ru_ru: **#ReportFooter**: Этот элемент div содержит нижний колонтитул отчёта.

source: **.ReportSQL**: This class is used by the <PRE></PRE> blocks containing SQL.
ru_ru: **.ReportSQL**: Этот класс назначен блокам <PRE></PRE>, содержащим SQL.

source: **.ReportDetailsOddDataRow**: This class is applied to the odd numbered rows of tables.
ru_ru: **.ReportDetailsOddDataRow**: Этот класс применяется к нечётным строкам таблиц.

source: **.ReportDetailsEvenDataRow**: This class is applied to the even numbered rows of tables.
ru_ru: **.ReportDetailsEvenDataRow**: Этот класс применяется к чётным строкам таблиц.

source: **.ReportTableHeaderCell**: This class is applied to table header cells.
ru_ru: **.ReportTableHeaderCell**: Этот класс применяется к ячейкам в заголовке таблицы.

source: **.ReportTableValueCell**: This class is applied to table data cells.
ru_ru: **.ReportTableValueCell**: Этот класс применяется к ячейкам таблицы с данными.

source: **.ReportTableInfo**: This class is applied to table footnotes.
ru_ru: **.ReportTableInfo**: Этот класс применяется к подписям таблиц.

source: When generating reports in XML format, you can opt to output plain XML, XML linked to an external XSL stylesheet, or to process the XML using an external stylesheet and save the resulting output. This allows complete flexibility to format reports in any way.
ru_ru: При построении отчётов в формате XML вы можете выбрать вывод в простой XML либо в XML, связанный с внешней таблицей стилей XSL, либо обработать XML, применив внешнее преобразование, и сохранить результат. Это даёт полную свободу для форматирования отчётов любым способом.

source: The default :ref:`XSL stylesheet <default-xsl>` used to render XHTML output can be used as a starting point for your own, and sample :ref:`XML data <sample-xml>` may also be reviewed if required.
ru_ru: При разработке собственного стиля вам может пригодиться :ref:`стиль XSL <default-xsl>` в качестве шаблона, а если потребуется, вы также можете взглянуть на :ref:`пример XML <sample-xml>`.

source: Contents:
ru_ru: Содержание:
