Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/restore.po
Languages: ru_ru

source: `Restore`:index:
ru_ru: `Восстановление`:index:

source: By selecting fields on the *Restore* dialog, you specify which options should be included in a customized `pg_restore <http://www.postgresql.org/docs/current/interactive/app-restore.html>`_ command. The pg_restore command plays back an archive that recreates the database, database object, or data described by commands within the archive.
ru_ru: Воспользовавшись полями в диалоге *Восстановление*, вы можете установить, какие аргументы должны быть переданы формируемой команде `pg_restore <https://postgrespro.ru/docs/postgresql/current/app-pgrestore.html>`_. Команда pg_restore воспроизводит содержащиеся в архиве команды, и таким образом воссоздаёт базу данных, объекты базы или данные, описываемые этими командами.

source: If your archive is in a Custom, Tar, or Directory format, you can use the Restore dialog to restore from the archive. If you have saved the backup in Plain format, use the psql client to restore.
ru_ru: Диалогом *Восстановление* вы можете воспользоваться, если ваш архив имеет формат «Специальный», «Tar» или «Каталог». Если вы выгружали данные в простом формате, для восстановления их воспользуйтесь клиентом psql.

source: Please Note: If you are restoring into an existing database, you must ensure that any objects that might create conflicts because of pre-existing constraints or dependencies are dropped or truncated; use the *DROP CASCADE* or *TRUNCATE CASCADE* options on the context menu to clean up existing conflicts before performing a restore.
ru_ru: Обратите внимание: если вы восстанавливаете данные в существующую базу, необходимо предварительно удалить или опустошить все объекты, в которых могут возникать конфликты из-за существующих ограничений или зависимостей; для этого перед восстановлением воспользуйтесь пунктами контекстного меню *Удалить каскадно* или *Опустошить каскадно*, чтобы предотвратить такие конфликты.

source: The Restore Dialog
ru_ru: Диалог восстановления

source: To open the *Restore* dialog, right click on the name of an object in the tree control and select Restore from the context menu. The *Restore* dialog opens:
ru_ru: Чтобы открыть диалог *Восстановление*, щёлкните имя объекта в дереве правой кнопкой и выберите в контекстном меню *Восстановить*. На экране появится этот диалог:

source: Use the fields on the *File Options* tab to general information about the backup archive. * Use the *Format* field to select the file format of the archive you are restoring. pgAdmin can restore from a Custom file (pg_dump format), a Tar file, or a Directory format file. * Use the *Filename* field to specify the name of the backup archive that will be used for the restore; optionally, use the file browser to navigate to and select the file. * Use the *Number of Jobs* field to instruct the server to use multiple concurrent jobs for the restore. The optimal value for this option depends on the hardware setup of the server, of the client, and of the network. This option is supported only by the Custom and Directory archive formats. * Use the *Rolename* field to specify the name of the role that will be used when invoking pg_restore.
ru_ru: Воспользуйтесь полями на вкладке *Свойства файла*, чтобы задать общую информацию об архиве данных. В поле *Формат* определите, архив какого типа вы собираетесь восстанавливать. pgAdmin может восстанавливать данные из файла специального формата (формата pg_dump), из файла Tar или из архива в формате каталога. В поле *Имя файла* задайте имя архива, который будет восстанавливаться; при желании вы можете найти и выбрать файл, воспользовавшись файловым обозревателем. В поле *Количество заданий* укажите, сколько параллельных заданий должен запускать сервер для выполнения восстановления. Оптимальное значение этого параметра зависит от аппаратной конфигурации сервера, клиента и характеристик сети. Этот параметр поддерживается только при выборе форматов «Специальный» и «Каталог». В списке *Имя роли* вы можете выбрать роль, которая будет использоваться при вызове pg_restore.

source: When you've completed the *File Options* tab, navigate to the *Restore Options #1* tab:
ru_ru: Завершив определение параметров на вкладке *Свойства файла*, перейдите ко вкладке *Параметры восстановления 1*:

source: Use the fields on the *Restore Options #1* tab to specify details about the type of objects that will be restored.
ru_ru: Воспользуйтесь полями на вкладке *Параметры восстановления 1*, чтобы определить, какие типы объектов будут восстановлены.

source: Use the checkboxes in the *Sections* box to select a portion of the object that will be restored. By default, a restore will include all sections.
ru_ru: В группе флажков *Секции* можно определить, какие разделы объектов будут восстанавливаться. По умолчанию восстанавливаются все разделы.

source: Check the box next to *Pre-data* to include all data definition items not included in the data or post-data item lists.
ru_ru: Отметьте флажок *Пред-данные*, чтобы включить в восстановление все элементы, не относящиеся к данным и пост-данным.

source: Check the box next to *Data* to include actual table data, large-object contents, and sequence values.
ru_ru: Отметьте флажок *Данные*, чтобы восстановить собственно данные таблиц, содержимое больших объектов и значения последовательностей.

source: Check the box next to *Post-data* to include definitions of indexes, triggers, rules, and constraints other than validated check constraints.
ru_ru: Отметьте флажок *Пост-данные*, чтобы включить в восстановление определения индексов, триггеров, правил и ограничений, за исключением проверяемых ограничений-проверок.

source: Use the checkboxes in the *Type of Objects* box to select the objects that will be restored. By default, all objects will be included.
ru_ru: Воспользуйтесь флажками в группе *Тип объектов*, чтобы выбрать, какие объекты будут восстановлены. По умолчанию восстанавливаются все объекты.

source: Check the box next to *Only data* to restore only the data.
ru_ru: Отметьте флажок *Только данные*, чтобы восстановить только данные, без схемы.

source: Check the box next to *Only schema* to restore only the schema (the data definitions).
ru_ru: Отметьте флажок *Только схема*, чтобы восстановить только схему (определения данных).

source: Use the checkboxes in the *Don't Save* box to select the objects that will not be included.
ru_ru: Воспользуйтесь флажками в группе *Не сохранять*, чтобы выбрать объекты, которые не должны восстанавливаться.

source: Check the box next to *Owner* to omit commands that set object ownership.
ru_ru: Отметьте флажок *Владелец*, чтобы опустить команды, устанавливающие владение объектами.

source: Check the box next to *Privilege* to omit commands that create access privileges.
ru_ru: Отметьте флажок *Права*, чтобы опустить команды, устанавливающие права доступа.

source: Check the box next to *Tablespace* to omit tablespaces.
ru_ru: Отметьте флажок *Табличное пространство*, чтобы опустить табличные пространства.

source: When you've completed the *Restore Options #1* tab, select the *Restore Options #2* tab:
ru_ru: Завершив настройку на вкладке *Параметры восстановления 1*, перейдите на вкладку *Параметры восстановления 2*:

source: Use the checkboxes in the *Queries* box to specify how the restore process should handle statements.
ru_ru: Воспользуйтесь флажками в группе *Запросы*, чтобы указать, как должны обрабатываться операторы в процессе восстановления.

source: Check the box next to *Include CREATE DATABASE* statement to include a command in the backup that creates a new database when restoring from the backup.
ru_ru: Отметьте флажок *Добавить CREATE DATABASE*, чтобы была добавлена команда, которая создаст новую базу данных при восстановлении.

source: Check the box next to *Clean before restore* to instruct the server to drop an object before restoring it from the archive. Please note that this option does not remove all dependencies for all objects; manual cleanup may be required before restoring into an existing database.
ru_ru: Отметьте флажок *Очистить перед восстановлением*, чтобы сервер удалял существующий объект, прежде чем восстанавливать идентичный объект из архива. Заметьте, что при этом не удаляются все зависимости всех объектов; для восстановления данных в существующую базу может потребоваться ручная очистка.

source: Check the box next to *Single transaction* to execute the restore as a single transaction; this ensures that all commands will complete successfully before the changes are applied.
ru_ru: Отметьте флажок *Одна транзакция*, чтобы восстановление производилось в одной транзакции; это гарантирует, что изменения применятся только после успешного выполнения всех команд.

source: Use the checkboxes in the *Disable* box to specify trigger and table loading preferences.
ru_ru: Воспользуйтесь флажками в группе *Выключить*, чтобы настроить поведение триггеров и процедуры загрузки данных.

source: Check the box next to *Trigger* (when creating a data-only backup) to include commands that will disable triggers on the target table while the data is being loaded.
ru_ru: Отметьте флажок *Триггер* (при восстановлении копии только данных), чтобы добавить команды, отключающие триггеры в целевой таблице на время загрузки данных.

source: Check the box next to *No Data for Failed Tables* to instruct pg_restore to not load table data if the create command for a table fails. Specifying this option prevents duplicate or obsolete data from being loaded into an existing table.
ru_ru: Отметьте флажок *Не загружать данные при ошибке создания таблицы*, чтобы программа pg_restore не загружала данные таблицы в случае ошибки команды её создания. Это позволяет не допустить загрузки в существующую таблицу устаревших или повторяющихся данных.

source: Use the checkboxes in the *Miscellaneous Behavior* box to specify additional restore options.
ru_ru: Воспользовавшись флажками в группе *Разное/поведение*, можно задать дополнительные параметры восстановления.

source: Check the box next to *Use SET SESSION AUTHORIZATION* to use SQL-standard SET SESSION AUTHORIZATION commands instead of ALTER OWNER commands to determine object ownership.
ru_ru: Отметьте флажок *Использовать SET SESSION AUTHORIZATION*, чтобы владение объектами устанавливалось с помощью этой SQL-команды, а не командами ALTER OWNER.

source: Check the box next to *Exit on Error* to exit the restore if an error is encountered while sending SQL commands to the database.
ru_ru: Отметьте флажок *Выход при ошибке*, чтобы восстановление завершалось сразу в случае ошибки выполнения команд SQL в базе данных.

source: Check the box next to *Verbose messages* to instruct pg_restore to use verbose messages.
ru_ru: Отметьте флажок *Подробные сообщения*, чтобы программа pg_restore выводила более детальные сообщения.

source: When you've completed the *Restore Options #2* tab, navigate to the Objects tab:
ru_ru: Завершив определение параметров на вкладке *Параметры восстановления 2*, перейдите ко вкладке *Объекты*:

source: Click the *Display objects* button to populate the tree control on the *Objects* tab; when the list of objects is displayed, check the box to the left of an object name to include that object from the restore.
ru_ru: Нажмите кнопку *Показать объекты*, чтобы наполнить содержимое вкладки *Объекты*; когда в нём появится список объектов, отмечая/снимая флажки рядом с именами объектов, вы можете исключить/включить их в число восстанавливаемых.

source: When you've completed the tabs, navigate to the *Messages* tab, and press *OK*.
ru_ru: Завершив с установкой параметров на этих вкладках, перейдите на вкладку *Сообщения* и нажмите *ОК*.

source: When the restoration completes, the *Messages* tab displays details about the restoration process:
ru_ru: По завершении восстановления на вкладке *Сообщения* будут выведены сведения о процессе восстановления:

source: If the restore was successful, the Messages tab will display:
ru_ru: Если установление прошло успешно, на вкладке *Сообщения* можно увидеть:

source: *Process returned exit code 0.*
ru_ru: *Процесс вернул код выхода 0.*

source: If you receive an exit code other than 0, scroll through the *Messages* window to locate the problem; after correcting the problem, you can repeat the process.
ru_ru: Если вы получаете код выхода, отличный от 0, прокрутите окно *Сообщения* для поиска информации о проблеме; устранив эту проблему, вы можете повторить процесс ещё раз.

source: Scroll to the top of the Messages dialog to view the executed pg_restore command. When you're finished, click *Done* to exit the *Restore* dialog.
ru_ru: Прокрутите содержимое в окне *Сообщения* в самый верх, чтобы увидеть выполненную команду pg_restore. Закончив, нажмите *Done*, чтобы закрыть этот диалог.
