Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/slony-install.po
Languages: ru_ru

source: `Slony-I administration with pgAdmin III: installation`:index:
ru_ru: `Администрирование Slony-I с помощью pgAdmin III: установка`:index:

source: Prerequisites
ru_ru: Предварительные требования

source: As a prerequisite to running Slony-I on PostgreSQL, the slony modules xxid and slony1_funcs must be present on all servers that have to run a Slony-I replication node. This is usually done by the Slony-I installation routine.
ru_ru: Предварительным требованием для запуска Slony-I в PostgreSQL является наличие модулей slony xxid и slony1_funcs на всех серверах, которые будут функционировать как узлы репликации Slony-I. Обычно, чтобы установить их, нужно следовать процедуре установки Slony-I.

source: Overview
ru_ru: Обзор

source: Setting up Slony-I for the first time can be a daunting task. The following sections of the pgAdmin helpfile will help guide you through creation of your first cluster.
ru_ru: Настройка Slony-I в первый раз может быть непростой задачей. Следующие разделы справки pgAdmin помогут вам в создании вашего первого кластера.

source: :ref:`Step 1 <create>`: Create the cluster on the master node.
ru_ru: :ref:`Шаг 1 <create>`: Создать кластер на ведущем узле.

source: :ref:`Step 2 <join>`: Add slave nodes to the cluster.
ru_ru: :ref:`Шаг 2 <join>`: Добавить к кластеру подчинённые узлы.

source: :ref:`Step 3 <path>`: Setup paths on each node to all other nodes.
ru_ru: :ref:`Шаг 3 <path>`: Настроить на всех узлах пути ко всем остальным узлам.

source: :ref:`Step 4 <listen>`: Setup listens on each node to all other nodes (**Note**: Not required with Slony-I v1.1 or later).
ru_ru: :ref:`Шаг 4 <listen>`: Настроить на всех узлах приём подключений остальных узлов (**Примечание**: не требуется с Slony-I версии 1.1 или новее).

source: :ref:`Step 5 <set>`: Create a replication set.
ru_ru: :ref:`Шаг 5 <set>`: Создать набор репликации.

source: :ref:`Step 6 <table>`: Add tables and sequences to the set.
ru_ru: :ref:`Шаг 6 <table>`: Добавить в набор таблицы и последовательности.

source: :ref:`Step 7 <subscription>`: Subscribe the slaves to the set.
ru_ru: :ref:`Шаг 7 <subscription>`: Подписать ведомых на этот набор.

source: **Note** At this point, the slon daemons (service engines on Windows) should be started.
ru_ru: **Примечание** К этому моменту демоны slon (в Windows это службы) уже должны быть запущены.

source: Create cluster and first node
ru_ru: Создание кластера и первого узла

source: To install a Slony-I cluster on the first database, the "New Slony-I Cluster" dialog is used. It executes the official Slony-I cluster creation SQL scripts, which are located in the directory configured in the :ref:`Options <options-browser>` dialog.
ru_ru: Чтобы установить кластер Slony-I в первой базе данных, воспользуйтесь диалогом *Новый кластер Slony-I...*. Он запускает официальные SQL-скрипты создания кластера Slony-I, расположенные в каталоге, который был задан в диалоге :ref:`Параметры <options-browser>`.

source: pgAdmin III needs to store information how to contact each individual node in the cluster. To achieve this, pgAdmin III uses the concept of "Administrative nodes".
ru_ru: pgAdmin III должен хранить информацию о том, как связываться с каждым отдельным узлом кластера. Для этого в pgAdmin III используется концепция «административных узлов».

source: Join additional nodes to cluster
ru_ru: Подсоединение дополнительных узлов к кластеру

source: After the first node in the Slony-I replication cluster has been successfully created, all subsequent nodes take their configuration and procedures from the first nodes. This process is called "Joining a cluster" in pgAdmin III. Usually, you should also select an existing node as admin node, to insure later accessibility from pgAdmin III.
ru_ru: После того, как был создан первый узел в кластере репликации Slony-I, все последующие узлы получают свою конфигурацию и процедуры с первого узла. Этот процесс в pgAdmin III называется подсоединением к кластеру. Обычно вы также должны выбрать существующий узел в качестве административного, чтобы впоследствии к нему можно было обращаться из pgAdmin III.

source: After you added a new node to the Slony-I cluster, you need to set up :ref:`replication paths <slony-path>` between the nodes, to enable communication between the nodes.
ru_ru: Добавив новый узел в кластер Slony-I, вы должны настроить :ref:`пути репликации <slony-path>` между узлами, чтобы узлы могли взаимодействовать друг с другом.

source: Upgrade node to new cluster software
ru_ru: Обновление кластерного программного обеспечения узла

source: When a cluster is to be upgraded to a new version of the Slony-I clustering software, the upgrade process has to be run on all nodes of the cluster. For each node, the slon daemon needs to be stopped, then the upgrade dialog is started and a node with the new software is selected (pgAdmin III will extract all software from that node), and finally the slon daemon is started again.
ru_ru: Когда в кластере устанавливается новая версия кластерного программного обеспечения Slony-I, процесс обновления необходимо провести на всех узлах кластера. На каждом узле для этого нужно остановить демон slon, а затем запустить диалог обновления, выбрать узел с обновлённым ПО (pgAdmin III получит всё необходимое с этого узла) и, наконец, запустить демон slon снова.

source: Currently, pgAdmin III does **not** support upgrading from slony creation scripts. Instead, create an intermediate cluster from the creation scripts, use it as a source for the upgrade dialog, and drop the cluster after usage. You may also use the slonik tool to upgrade the first node, and then use it as source for subsequent node upgrades.
ru_ru: В настояще время pgAdmin III **не** поддерживает обновление из скриптов создания slony. Чтобы произвести обновление, нужно создать промежуточный кластер из скриптов создания, и указать его в качестве источника в диалоге обновления, а когда он станет ненужным, удалить его. Вы также можете воспользоваться утилитой slonik для обновления первого узла, а затем указать его в качестве источника при обновлении последующих узлов.
