Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/slony-example.po
Languages: ru_ru

source: `Slony-I example`:index:
ru_ru: `Пример использования Slony-I`:index:

source: In this example, a master server is setup with two direct slaves. This example was written and tested using Slony-I v1.2.11 and PostgreSQL 8.2.5, running on a single Windows XP machine. The PostgresSQL pgbench utility is used to generate the test schema and workload.
ru_ru: В этом примере настраивается ведущий сервер с двумя непосредственными ведомыми. Этот пример был написан и проверен с использованием Slony-I v1.2.11 и PostgreSQL 8.2.5, работающими в одной системе Windows XP. Для генерации тестовой схемы и рабочей нагрузки использовалась утилита PostgresSQL pgbench.

source: Create 3 databases, master, slave1 and slave2 and ensure pl/pgsql is setup in each.
ru_ru: Создайте 3 базы данных: master, slave1 и slave2 и удостоверьтесь, что в каждой из них установлен pl/pgsql.

source: Create a pgbench schema in the master database::
ru_ru: Создайте схему pgbench в базе данных master::

source: Add a primary key called history_pkey to the history table on the tid, bid and aid columns
ru_ru: Добавьте первичный ключ с именем history_pkey в таблицу history по столбцам tid, bid и aid.

source: Create a schema-only dump of the master database, and load it into slave1 and slave2::
ru_ru: Выгрузите только схему базы данных master и загрузите её в базы slave1 и slave2::

source: Create Slony config files for each slon engine (daemon on Unix). The files should contain just the following two lines::
ru_ru: Создайте файлы конфигурации Slony для каждой службы slon (демона в Unix). Эти файлы должны содержать только две следующие строки::

source: Create a file for each database, adjusting the dbname parameter as required and adding any other connection options that may be needed.
ru_ru: Создайте такой файл для каждой базы данных, изменив параметр dbname должным образом и добавив другие параметры подключения, которые могут потребоваться.

source: (Windows only) Install the Slony-I service::
ru_ru: (Только в Windows) Установите службу Slony-I::

source: Register each of the engines (this is only necessary on Windows - on Unix the slon daemons may be started individually and given the path to the config file on the command line using the -f option)::
ru_ru: Зарегистрируйте все службы (это требуется только в Windows — в Unix демоны slon должны запускаться по отдельности и им в командной строке с ключом -f должен передаваться путь к файлу конфигурации)::

source: In pgAdmin under the Slony Replication node in the master database, create a new Slony-I cluster using the following options::
ru_ru: В pgAdmin в разделе *Репликация Slony*, подчинённом узлу ведущей базы данных (master), создайте кластер Slony-I со следующими параметрами::

source: Under the Slony Replication node, create a Slony-I cluster in each of the slave databases using the following options::
ru_ru: Для ведомых баз данных в подчинённом разделе *Репликация Slony* создайте кластер Slony-I со следующими параметрами::

source: Create Paths on the master to both slaves, and on each slave back to the master. Create the paths under each node on the master, using the connection strings specified in the slon config files. Note that future restructuring of the cluster may require additional paths to be defined.
ru_ru: Создайте пути в ведущей базе к обеим ведомым базам и в каждой ведомой базе обратный путь к ведущей. Создавайте пути под каждым узлом в ведущей базе, используя строки подключения, указанные в файлах конфигурации slon. Заметьте, чтобы при будущей реструктуризации кластера может потребоваться определить дополнительные пути.

source: Create a Replication Set on the master using the following settings::
ru_ru: Создайте набор репликации в ведущей базе со следующими свойствами::

source: Add the tables to the replication set using the following settings::
ru_ru: Добавьте таблицы в набор репликации со следующими свойствами::

source: On the master node, create a new subscription for each slave using the following options::
ru_ru: На ведущем узле создайте новую подписку для каждого ведомого со следующими параметрами::

source: Start the slon service (or daemons on Unix)::
ru_ru: Запустите службы slon (или демоны в Unix)::

source: Initial replication should begin and can be monitored on the statistics tab in pgAdmin for each node. The pgbench utility may be run against the master database to generate a test workload.
ru_ru: После этого должна начаться начальная репликация и за ней можно будет наблюдать на вкладке статистики в pgAdmin для каждого узла. Для генерирования рабочей нагрузки можно запустить утилиту pgbench, нацелив её на ведущую базу данных (master).
