Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/slony-set.po
Languages: ru_ru

source: `Creating sets and subscriptions`:index:
ru_ru: `Создание наборов и подписок`:index:

source: Create replication set
ru_ru: Создание набора репликации

source: Slony-I groups tables and sequences it has to replicate from a master to slaves into replication sets. The set is created on the source node of the data.
ru_ru: Slony-I группирует таблицы и последовательности, которые должны реплицироваться с ведущего на ведомые узлы, в наборы репликации. Набор создаётся на узле-источнике данных.

source: Define replicated table
ru_ru: Определение реплицируемой таблицы

source: If the source table has triggers defined on it, these have to be disabled on replication target nodes. But in replication environments, the master and slave roles might exchange, so it is necessary to enable and disable triggers in those situations. The 'Trigger' page allows selection of triggers that Slony-I should enable and disable if necessary.
ru_ru: Если в исходной таблице определены триггеры, они должны быть отключены на целевых узлах репликации. Но в конфигурации, где реализуется репликация, ведущий и ведомый могут меняться ролями, и в таких случаях необходимо отключать/включать триггеры. На вкладке *Триггер* вы можете выбрать, какие триггеры система Slony-I должна включать и отключать при необходимости.

source: **Attention:** If a table you'd like to have replicated doesn't appear in the table combobox, this usually means that the table lacks a unique index. Slony-I requires that each row in tables that are to be replicated must be uniquely identifyable. Usually, this should be done with a primary key, but for replication purposes a unique key is satisfactory.
ru_ru: **Внимание:** Если таблица, которую вы хотите реплицировать, отсутствует в выпадающем списке с таблицами, обычно это означает, что в таблице нет уникального индекса. Slony-I требует, чтобы все строки в таблицах, которые будут реплицироваться, могли идентифицироваться однозначным образом. Обычно для этого используется первичный ключ, но для целей репликации достаточно любого уникального ключа.

source: While Slony-I has a helper function to define intermediate unique keys, this is not supported with tables added to replication sets with pgAdmin III. We strongly recommend defining a primary key on the tables to be replicated.
ru_ru: Хотя в Slony-I имеется вспомогательная функция, определяющая промежуточные уникальные ключи, её использование не поддерживается при добавлении таблиц в наборы репликации с помощью pgAdmin III. Мы настоятельно рекомендуем определять в реплицируемых таблицах первичный ключ.

source: Define replicated sequence
ru_ru: Определение реплицируемой последовательности

source: The sequence allows adding sequences to a replication set.
ru_ru: Этот диалог позволяет добавлять последовательности в набор репликации.

source: Subscribe a replication set
ru_ru: Подписка на набор репликации

source: After a replication set has been defined, it can be subscribed. Subscriptions have to be created on the source node (note: on Slony-1 before v1.1, this had to be performed on the target node).
ru_ru: Когда набор репликации определён, на него можно подписаться. Подписки нужно создавать на исходном узле (замечание: в Slony-1 до версии 1.1 это нужно было делать на целевом узле).

source: After a set has been subscribed, its table and sequence definition can't be changed any more. To add more tables, you can create a set that includes the additional tables and sequences you'd like to have added to the first replication set, then subscribe exactly the same receiver nodes to it, and finally use :ref:`Merge <slony-functions>` to merge both sets into one.
ru_ru: После того, как добавлена подписка на набор, определение таблиц и последовательностей в нём изменять больше нельзя. Чтобы добавить в набор другие таблицы, вы можете создать новый набор, включить в него те дополнительные таблицы и последовательности, которые вы хотите включить в первый набор, затем подписать на него те же ведомые узлы, и наконец, выполнить :ref:`Слияние <slony-functions>`, чтобы объединить два набора в один.
