Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/status.po
Languages: ru_ru

source: `Database Server Status`:index:
ru_ru: `Состояние сервера баз данных`:index:

source: The Server Status dialogue displays the current connections to each database, the user that is connected, the process ID, the client address and start time (on PostgreSQL 8.1 and above), the current query being executed (if any), and the query start time (where appropriate) on PostgreSQL 7.4 and above on the Status tab.
ru_ru: В панели *Активность* диалога *Состояние сервера* показываются текущие подключения ко всем базам данных, подключённые пользователи, идентификаторы серверных процессов, адреса клиентов и время их подключения (с PostgreSQL 8.1 и новее), а также выполняемые запросы и время начала их выполнения (если есть такая информация) с PostgreSQL 7.4 и новее.

source: The Cancel button allows cancelling the query running on a specific backend. Terminate will shutdown the backend. **Attention:** Both functions should be used carefully, as the interrupt the client's work ungracefully. Particularly, the terminate function might disturb the function of the complete server, force it to restart its services and thus interrupt all user connections. You should use this function only if the server is seriously injured by a backend you can't control otherwise.
ru_ru: Кнопка *Отменить запрос* позволяет прервать выполнение запроса в определённом серверном процессе, а кнопка *Завершить процесс* — остановить весь процесс. **Внимание:** Пользоваться этими функциями следует осторожно, так как они прерывают работу клиентов нештатно. В частности, функция завершения процесса может нарушить работу всей СУБД так, что потребуется полностью перезапустить все серверные службы и таким образом прервать все соединения пользователей. Применять эту функцию следует, только если сервер подвержен негативному влиянию обслуживающего процесса, на который вы не можете воздействовать больше никак.

source: The Locks tab shows the current locks outstanding in the PostgreSQL Lock Manager. This information can be useful when attempting to debug or track down deadlocks on your server. Not all information is necessarily shown for each lock. In particular, the Relation name may be shown as an OID instead of by it's name, if the relation is in a different database to that being monitored.
ru_ru: В панели *Блокировки* показываются текущие блокировки, контролируемые менеджером блокировок PostgreSQL. Эти сведения могут быть полезны, когда вам нужно выявить или отследить взаимоблокировки на сервере. Информация о блокировках может быть неполной, в зависимости от их типа. В частности, в столбце *Отношение* может показываться OID отношения, а не его имя, если это отношение находится в базе данных, отличной от текущей.

source: **Note:** When the pg_locks view is accessed as is the case whenever this dialgue is open, PostgreSQL's internal lock manager data structures are momentarily locked, and a copy is made for the dialogue to display. This ensures that the dialogue displays a consistent set of results, while not blocking normal lock manager operations longer than necessary. Nonetheless there could be some impact on database performance if this view is read often.
ru_ru: **Замечание:** Когда происходит обращение к представлению pg_locks, что имеет место при открытии этого диалога, внутренние структуры на мгновение блокируются и копируются отдельно для отображения. Это гарантирует, что данный диалог показывает согласованное состояние и при этом работа менеджера блокировок приостанавливается лишь на минимальное время. Тем не менее, если к этому представлению обращаться слишком часто, это может повлиять на производительность базы данных.

source: On a PostgreSQL server running version 8.1 or newer, the Transaction tab allows you to view outstanding prepared transactions. Prepared transactions are an aspect of Two Phase Commit (2PC), used in distributed transaction managers. Usually, prepared transactions are handled by the transaction manager. In case of a failure, it might be necessary to commit or rollback a transaction manually; you can use the 'Commit' or 'Rollback' buttons to do this.
ru_ru: С сервером PostgreSQL версии 8.1 или новее, в панели *Подготовленные транзакции* показываются ожидающие завершения подготовленные транзакции. Подготовленные транзакции задействуются в процедуре двухфазной фиксации (2PC), которая применяется менеджерами распределённых транзакций. В случае сбоя может возникнуть необходимость зафиксировать или откатить такую транзакцию вручную: для этого можно воспользоваться соответствующими кнопками на панели инструментов.

source: The Logfile tab shows server log files, if configured in postgresql.conf (redirect_stderr or logging_collector = true, log_destination = 'stderr' and log_filename = 'postgresql-%Y-%m-%d_%H%M%S.log' on PostgreSQL or 'enterprisedb-%Y-%m-%d_%H%M%S.log' on EnterpriseDB's Advanced Server). pgAdmin will extract a time stamp from the logfile in a separate column, if the log_line_prefix is configured accordingly. We recommend using '%t:' as format, because more complicate formats might not be interpretable correctly.
ru_ru: В панели *Файл журнала* показывается содержимое файлов журналов, если в postgresql.conf настроена запись в журналы (redirect_stderr или logging_collector = true, log_destination = 'stderr' и log_filename = 'postgresql-%Y-%m-%d_%H%M%S.log' в PostgreSQL либо 'enterprisedb-%Y-%m-%d_%H%M%S.log' в EnterpriseDB Advanced Server). pgAdmin извлекает отметку времени из файла журнала в отдельный столбец, если параметр log_line_prefix настроен должным образом. Мы рекомендуем задать для него формат '%t:', так как более сложные форматы могут восприниматься некорректно.

source: The combobox allows you to select historic logfiles or the current one. If "current" is selected, pgAdmin will correctly detect logfile rotation and continue to display them.
ru_ru: В выпадающем списке вы можете выбрать предыдущие файлы журналов или текущий. Если выбран *Текущий журнал*, pgAdmin будет следить за прокруткой журналов и продолжит отображать актуальное содержимое.

source: The "Rotate" button will force the server to rotate its server logfile. This function is currently not implemented on 8.0 servers; if you think this is valuable for you please contact us.
ru_ru: Если нажать кнопку *Прокрутка*, сервер получит указание прокрутить файла журнала. Эта функция в настоящее время не реализована для серверов 8.0; если вы считаете, что она нужна, свяжитесь с разработчиками.

source: Please note that displaying the logfile requires :ref:`additional functions <extend>` loaded on the server side, which are available for 8.x servers only.
ru_ru: Заметьте, что для отображения файла журнала требуются, чтобы на сервере были загружены :ref:`дополнительные функции <extend>`, а они устанавливаются только на серверы 8.x и новее.

source: To refresh the display click the *Refresh* button. The display will also be automatically refreshed based on the refresh interval specified. Note that you have one refresh rate per tab.
ru_ru: Чтобы обновить содержимое окна, можно нажать кнопку *Обновить*. Содержимое также обновляется автоматически через заданный промежуток времени. Заметьте, что интервал обновления задаётся для каждой панели отдельно.

source: You can hide panes by clicking on their close button or by clicking on the appropiate menu item in the View menu.
ru_ru: Вы можете скрыть ненужную панель, щёлкнув кнопку закрытия в её заголовке либо выбрав соответствующий пункт в меню *Вид*.

source: You can also copy some lines on the tabs' list. Select the lines you want to copy and click on the Copy button of the toolbar.
ru_ru: Вы также можете скопировать какие-либо строки из содержимого панелей. Для этого выделите нужные строки текста и нажмите кнопку *Копировать* на панели инструментов.
