Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/team.po
Languages: ru_ru

source: The pgAdmin Development Team
ru_ru: Команда разработчиков pgAdmin

source: **Version 2.3, 5 March 2009**
ru_ru: **Версия 2.3, 5 марта 2009 г.**

source: **Purpose**
ru_ru: **Цель существования**

source: The pgAdmin Development Team exists for 2 reasons:
ru_ru: Команда разработчиков pgAdmin существует для того, чтобы:

source: To manage and maintain the pgAdmin Project
ru_ru: Управлять проектом pgAdmin и поддерживать его

source: To ensure that pgAdmin remains freely available to anyone that wants it.
ru_ru: Гарантировать, что pgAdmin останется свободным и бесплатным для всех желающих.

source: **Structure**
ru_ru: **Структура**

source: The foundation consists of the Project Leader and Members.
ru_ru: Наша организация состоит из руководителя проекта и участников.

source: **Project Leader**: The Project Leader is Dave Page, founder and primary developer of the software. The Project Leader is also considered a member.
ru_ru: **Руководитель проекта**: Дейв Пейдж, основатель и основной разработчик программного продукта. Руководитель проекта также считается участником.

source: **Members**: Members can be any contributor to the project who accepts an invitation from the existing Development Team.
ru_ru: **Участники**: участниками могут быть любые лица, внёсшие вклад в проект и принявшие предложение присоединиться к существующей команде разработчиков.

source: **Division of Responsibilities**
ru_ru: **Разделение ответственности**

source: Any major decision regarding the Project must be voted on by the Development Team. Any vote will be made via email through the relevant mailing list. Responses not received within 2 weeks will be discounted from the vote.
ru_ru: Все важные решения относительно проекта должны приниматься в результате голосования участников проекта. Голосование будет проводиться по электронной почте в соответствующем списке рассылки. Голоса, не полученные в течение 2 недель, при голосовании учитываться не будут.

source: In the case of a hung vote, the Project Leader shall cast the deciding vote.
ru_ru: При равенстве голосов окончательное решение принимает руководитель проекта.

source: **People**
ru_ru: **Люди**

source: The pgAdmin Development Team includes the following people:
ru_ru: В состав команды разработчиков pgAdmin входят следующие люди:

source: `Dave Page <mailto:dpage@pgadmin.org>`_ (Project Leader): Project founder & primary developer.
ru_ru: `Дейв Пейдж <mailto:dpage@pgadmin.org>`_ (Руководитель проекта): Основатель и главный разработчик проекта.

source: `Hiroshi Saito <mailto:z-saito@guitar.ocn.ne.jp>`_: Produced a Japanese port of pgAdmin II, and countless patches for pgAdmin III.
ru_ru: `Хироси Сайто <mailto:z-saito@guitar.ocn.ne.jp>`_: Разработал японскую версию pgAdmin II и предложил бесчисленное количество правок для pgAdmin III.

source: `Raphaël Enrici <mailto:raphael@pgadmin.org>`_: Maintains the Debian port, and helps with numerous other issues.
ru_ru: `Рафаэль Энричи <mailto:raphael@pgadmin.org>`_: Поддерживает порт pgAdmin для Debian и помогает со многими другими делами.

source: `Guillaume Lelarge <mailto:guillaume@lelarge.info>`_: Manages the pgAdmin application and website translations, and has added a number of enhancements to pgAdmin.
ru_ru: `Гийом Леларж <mailto:guillaume@lelarge.info>`_: Заведует переводами приложения и сайта pgAdmin, внёс множество улучшений в pgAdmin.

source: `Erwin Brandstetter <mailto:brandstetter@falter.at>`_: Spends significant amounts of time testing new releases and helping us track down bugs and behavioural issues.
ru_ru: `Эрвин Брандштеттер <mailto:brandstetter@falter.at>`_: Потратил весьма значительное время на тестирование новых выпусков и помогал нам отслеживать ошибки и некорректное поведение.

source: `Magnus Hagander <mailto:magnus@hagander.net>`_: Has worked on numerous features and project infrastructure.
ru_ru: `Магнус Хагандер <mailto:magnus@hagander.net>`_: Работал над множеством функций и инфраструктурой проекта.

source: The following people no longer work on the project, but we remain grateful for their past contributions:
ru_ru: Перечисленные ниже люди уже не работают над проектом, но мы по-прежнему признательны им за их вклад:

source: `Mark Yeatman <mailto:myeatman@vale-housing.co.uk>`_: Works on controls and consults on UI design.
ru_ru: `Марк Йитман <mailto:myeatman@vale-housing.co.uk>`_: Работал над элементами управления и консультировал по вопросам дизайна интерфейса.

source: `Frank Lupo <mailto:frank_lupo@email.it>`_: Has made countless improvements to the pgAdmin II code from minor bug fixes to major enhancements.
ru_ru: `Франк Лупо <mailto:frank_lupo@email.it>`_: Внёс бесчисленное множество улучшений в код pgAdmin II, от исправления небольших ошибок и до значительных доработок

source: `Jean-Michel Pouré <mailto:jm@poure.com>`_: translations & web site management.
ru_ru: `Жан-Мишель Пуре <mailto:jm@poure.com>`_: Занимался переводом и управлением сайтом.

source: `Andreas Pflug <mailto:pgadmin@pse-consulting.de>`_: Has written vast amounts of pgAdmin III code and is responsible for much of its design.
ru_ru: `Андреас Пфлюг <mailto:pgadmin@pse-consulting.de>`_: Написал большой объём кода pgAdmin III и во многом определил его дизайн.

source: `Adam H. Pendleton <mailto:fmonkey@fmonkey.net>`_: Developed and maintains the build system, and helps with various porting issues.
ru_ru: `Адам Х. Пендлтон <mailto:fmonkey@fmonkey.net>`_: Разработал и поддерживал систему сборки, а также помогал решать различные вопросы портирования.
