Repository: Alinikol/pg-doc-ru
Catalog: pgadmin3-doc/translation_team.po
Languages: ru_ru

source: Translation team
ru_ru: Команда перевода

source: We are very grateful to those who commit time to translating pgAdmin III. Here is the list of translators, ordered by language code:
ru_ru: Мы очень признательны всем, кто посвящает своё время переводу pgAdmin III. Ниже мы приводим список всех переводчиков, упорядоченный по коду языка:

source: af_ZA (Afrikaans) by `Petri Jooste <mailto:rkwjpj@puknet.puk.ac.za>`_
ru_ru: af_ZA (Африкаанс) `Петри Жусте <mailto:rkwjpj@puknet.puk.ac.za>`_

source: bg_BG (Bulgarian) by `Milen A. Radev <mailto:milen@radev.net>`_
ru_ru: bg_BG (Болгарский) `Милен А. Радев <mailto:milen@radev.net>`_

source: ca_ES (Catalan) by `Carme Cerda Torres <mailto:carmect74@gmail.com>`_
ru_ru: ca_ES (Каталонский) `Карме Серда Торрес <mailto:carmect74@gmail.com>`_

source: de_DE (German) by `Harald Armin Massa <mailto:haraldarminmassa@gmail.com>`_
ru_ru: de_DE (Немецкий) `Гаральд Армин Масса <mailto:haraldarminmassa@gmail.com>`_

source: es_ES (Spanish) by `mailto:diego@adminsa.com">Diego A. Gil <mailto:diego@adminsa.com>`_
ru_ru: es_ES (Испанский) `mailto:diego@adminsa.com">Диего А. Гил <mailto:diego@adminsa.com>`_

source: fi_FI (Finnish) by `Jori Juoto <mailto:psql@jorch.net>`_
ru_ru: fi_FI (Финский) `Йори Юото <mailto:psql@jorch.net>`_

source: fr_FR (French) by `Guillaume Lelarge <mailto:guillaume@lelarge.info>`_ and `Raphael Enrici <mailto:blacknoz@club-internet.fr>`_
ru_ru: fr_FR (Французский) `Гийом Леларж <mailto:guillaume@lelarge.info>`_ и `Рафаэль Энричи <mailto:blacknoz@club-internet.fr>`_

source: gl_ES (Galician) by `Antonio Ricoy Riego <mailto:aricoy@edu.xunta.es>`_
ru_ru: gl_ES (Галисийский) `Антонио Рико Риего <mailto:aricoy@edu.xunta.es>`_

source: it_IT (Italian) by `Giuseppe Sacco <mailto:giuseppe@eppesuigoccas.homedns.org>`_
ru_ru: it_IT (Итальянский) `Джузеппе Сакко <mailto:giuseppe@eppesuigoccas.homedns.org>`_

source: ja_JP (Japanese) by `Hiroshi Saito <mailto:z-saito@guitar.ocn.ne.jp>`_
ru_ru: ja_JP (Японский) `Хироси Сайто <mailto:z-saito@guitar.ocn.ne.jp>`_

source: ko_KR (Korean) by `Kang Hye Won <mailto:lain13@gmail.com>`_
ru_ru: ko_KR (Корейский) `Канг Хе Ван <mailto:lain13@gmail.com>`_

source: lv_LV (Latvian) by `Rudolfs Mazurs <mailto:rudolfs.mazurs@gmail.com>`_
ru_ru: lv_LV (Латвийский) `Рудольфс Мазурс <mailto:rudolfs.mazurs@gmail.com>`_

source: nl_NL (Dutch) by `Fred van Bemmel <mailto:f.van.bemmel@hccnet.nl>`_
ru_ru: nl_NL (Датский) `Фред ван Беммель <mailto:f.van.bemmel@hccnet.nl>`_

source: pl_PL (Polish) by `Slawomir Sudnik <mailto:slaweks@inbox.com>`_
ru_ru: pl_PL (Польский) `Славомир Судник <mailto:slaweks@inbox.com>`_

source: pt_BR (Portuguese Brazilian) by `Marcos Alves T. de Azevedo <mailto:psylinux@gmail.com>`_
ru_ru: pt_BR (Португальский бразильский) `Маркос Альвес Т. де Азеведо <mailto:psylinux@gmail.com>`_

source: pt_PT (Portuguese) by `Helder M. Vieira <mailto:hmv@mail.telepac.pt>`_
ru_ru: pt_PT (Португальский) `Хельдер М. Виейра <mailto:hmv@mail.telepac.pt>`_

source: ru_RU (Russian) by `Vladimir Kazimirov <mailto:v.kazimirov@mail.ru>`_
ru_ru: ru_RU (Русский) `Владимир Казимиров <mailto:v.kazimirov@mail.ru>`_

source: sr_RS (Serbian) by `Bojan Skaljac <mailto:skaljac@gmail.com>`_
ru_ru: sr_RS (Сербский) `Божан Скальяч <mailto:skaljac@gmail.com>`_

source: zh_CN (Chinese simplified) by `ChaoYi, Kuo <mailto:kuo.chaoyi@gmail.com>`_
ru_ru: zh_CN (Китайский упрощённый) `Чаой, Куо <mailto:kuo.chaoyi@gmail.com>`_

source: zh_TW (Chinese traditional) by `NSYSU MIS <mailto:learncoding@mis.nsysu.edu.tw>`_
ru_ru: zh_TW (Китайский традиционный) `NSYSU MIS <mailto:learncoding@mis.nsysu.edu.tw>`_

source: There are other translations in progress, you can check the current translation status at our `Translation status <http://www.pgadmin.org/translation/status.php>`_ page.
ru_ru: Работа над переводом продолжается, текущее положение дел вы можете увидеть на странице `состояния перевода <http://www.pgadmin.org/translation/status.php>`_.
